RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/usb_reg.h
/* 0x018 : USBINTR */
#define USBINTR_OFFSET         (0x018)
#define USB_INT_EN             USB_INT_EN
#define USB_INT_EN_POS         (0U)
#define USB_INT_EN_LEN         (1U)
#define USB_INT_EN_MSK         (((1U << USB_INT_EN_LEN) - 1) << USB_INT_EN_POS)
#define USB_INT_EN_UMSK        (~(((1U << USB_INT_EN_LEN) - 1) << USB_INT_EN_POS))
#define USBERR_INT_EN          USBERR_INT_EN
#define USBERR_INT_EN_POS      (1U)
#define USBERR_INT_EN_LEN      (1U)
#define USBERR_INT_EN_MSK      (((1U << USBERR_INT_EN_LEN) - 1) << USBERR_INT_EN_POS)
#define USBERR_INT_EN_UMSK     (~(((1U << USBERR_INT_EN_LEN) - 1) << USBERR_INT_EN_POS))
#define USB_PO_CHG_INT_EN      USB_PO_CHG_INT_EN
#define USB_PO_CHG_INT_EN_POS  (2U)
#define USB_PO_CHG_INT_EN_LEN  (1U)
#define USB_PO_CHG_INT_EN_MSK  (((1U << USB_PO_CHG_INT_EN_LEN) - 1) << USB_PO_CHG_INT_EN_POS)
#define USB_PO_CHG_INT_EN_UMSK (~(((1U << USB_PO_CHG_INT_EN_LEN) - 1) << USB_PO_CHG_INT_EN_POS))
#define USB_FRL_ROL_EN         USB_FRL_ROL_EN
#define USB_FRL_ROL_EN_POS     (3U)
#define USB_FRL_ROL_EN_LEN     (1U)
#define USB_FRL_ROL_EN_MSK     (((1U << USB_FRL_ROL_EN_LEN) - 1) << USB_FRL_ROL_EN_POS)
#define USB_FRL_ROL_EN_UMSK    (~(((1U << USB_FRL_ROL_EN_LEN) - 1) << USB_FRL_ROL_EN_POS))
#define USB_H_SYSERR_EN        USB_H_SYSERR_EN
#define USB_H_SYSERR_EN_POS    (4U)
#define USB_H_SYSERR_EN_LEN    (1U)
#define USB_H_SYSERR_EN_MSK    (((1U << USB_H_SYSERR_EN_LEN) - 1) << USB_H_SYSERR_EN_POS)
#define USB_H_SYSERR_EN_UMSK   (~(((1U << USB_H_SYSERR_EN_LEN) - 1) << USB_H_SYSERR_EN_POS))
#define USB_INT_OAA_EN         USB_INT_OAA_EN
#define USB_INT_OAA_EN_POS     (5U)
#define USB_INT_OAA_EN_LEN     (1U)
#define USB_INT_OAA_EN_MSK     (((1U << USB_INT_OAA_EN_LEN) - 1) << USB_INT_OAA_EN_POS)
#define USB_INT_OAA_EN_UMSK    (~(((1U << USB_INT_OAA_EN_LEN) - 1) << USB_INT_OAA_EN_POS))

/* 0x01C : FRINDEX */
#define USB_FRINDEX_OFFSET (0x01C)
#define USB_FRINDEX        USB_FRINDEX
#define USB_FRINDEX_POS    (0U)
#define USB_FRINDEX_LEN    (14U)
#define USB_FRINDEX_MSK    (((1U << USB_FRINDEX_LEN) - 1) << USB_FRINDEX_POS)
#define USB_FRINDEX_UMSK   (~(((1U << USB_FRINDEX_LEN) - 1) << USB_FRINDEX_POS))

/* 0x024 : PERIODICLISTBASE */
#define USB_PERIODICLISTBASE_OFFSET (0x024)
#define USB_PERI_BASADR             USB_PERI_BASADR
#define USB_PERI_BASADR_POS         (12U)
#define USB_PERI_BASADR_LEN         (20U)
#define USB_PERI_BASADR_MSK         (((1U << USB_PERI_BASADR_LEN) - 1) << USB_PERI_BASADR_POS)
#define USB_PERI_BASADR_UMSK        (~(((1U << USB_PERI_BASADR_LEN) - 1) << USB_PERI_BASADR_POS))

/* 0x028 : ASYNCLISTADDR */
#define USB_ASYNCLISTADDR_OFFSET (0x028)
#define USB_ASYNC_LADR           USB_ASYNC_LADR
#define USB_ASYNC_LADR_POS       (5U)
#define USB_ASYNC_LADR_LEN       (27U)
#define USB_ASYNC_LADR_MSK       (((1U << USB_ASYNC_LADR_LEN) - 1) << USB_ASYNC_LADR_POS)
#define USB_ASYNC_LADR_UMSK      (~(((1U << USB_ASYNC_LADR_LEN) - 1) << USB_ASYNC_LADR_POS))

/* 0x030 : PORTSC */
#define USB_PORTSC_OFFSET      (0x030)
#define USB_CONN_STS           USB_CONN_STS
#define USB_CONN_STS_POS       (0U)
#define USB_CONN_STS_LEN       (1U)
#define USB_CONN_STS_MSK       (((1U << USB_CONN_STS_LEN) - 1) << USB_CONN_STS_POS)
#define USB_CONN_STS_UMSK      (~(((1U << USB_CONN_STS_LEN) - 1) << USB_CONN_STS_POS))
#define USB_CONN_CHG           USB_CONN_CHG
#define USB_CONN_CHG_POS       (1U)
#define USB_CONN_CHG_LEN       (1U)
#define USB_CONN_CHG_MSK       (((1U << USB_CONN_CHG_LEN) - 1) << USB_CONN_CHG_POS)
#define USB_CONN_CHG_UMSK      (~(((1U << USB_CONN_CHG_LEN) - 1) << USB_CONN_CHG_POS))
#define USB_PO_EN              USB_PO_EN
#define USB_PO_EN_POS          (2U)
#define USB_PO_EN_LEN          (1U)
#define USB_PO_EN_MSK          (((1U << USB_PO_EN_LEN) - 1) << USB_PO_EN_POS)
#define USB_PO_EN_UMSK         (~(((1U << USB_PO_EN_LEN) - 1) << USB_PO_EN_POS))
#define USB_PO_EN_CHG          USB_PO_EN_CHG
#define USB_PO_EN_CHG_POS      (3U)
#define USB_PO_EN_CHG_LEN      (1U)
#define USB_PO_EN_CHG_MSK      (((1U << USB_PO_EN_CHG_LEN) - 1) << USB_PO_EN_CHG_POS)
#define USB_PO_EN_CHG_UMSK     (~(((1U << USB_PO_EN_CHG_LEN) - 1) << USB_PO_EN_CHG_POS))
#define USB_F_PO_RESM          USB_F_PO_RESM
#define USB_F_PO_RESM_POS      (6U)
#define USB_F_PO_RESM_LEN      (1U)
#define USB_F_PO_RESM_MSK      (((1U << USB_F_PO_RESM_LEN) - 1) << USB_F_PO_RESM_POS)
#define USB_F_PO_RESM_UMSK     (~(((1U << USB_F_PO_RESM_LEN) - 1) << USB_F_PO_RESM_POS))
#define USB_PO_SUSP            USB_PO_SUSP
#define USB_PO_SUSP_POS        (7U)
#define USB_PO_SUSP_LEN        (1U)
#define USB_PO_SUSP_MSK        (((1U << USB_PO_SUSP_LEN) - 1) << USB_PO_SUSP_POS)
#define USB_PO_SUSP_UMSK       (~(((1U << USB_PO_SUSP_LEN) - 1) << USB_PO_SUSP_POS))
#define USB_PO_RESET           USB_PO_RESET
#define USB_PO_RESET_POS       (8U)
#define USB_PO_RESET_LEN       (1U)
#define USB_PO_RESET_MSK       (((1U << USB_PO_RESET_LEN) - 1) << USB_PO_RESET_POS)
#define USB_PO_RESET_UMSK      (~(((1U << USB_PO_RESET_LEN) - 1) << USB_PO_RESET_POS))
#define USB_LINE_STS           USB_LINE_STS
#define USB_LINE_STS_POS       (10U)
#define USB_LINE_STS_LEN       (2U)
#define USB_LINE_STS_MSK       (((1U << USB_LINE_STS_LEN) - 1) << USB_LINE_STS_POS)
#define USB_LINE_STS_UMSK      (~(((1U << USB_LINE_STS_LEN) - 1) << USB_LINE_STS_POS))
#define USB_PORT_TEST          USB_PORT_TEST
#define USB_PORT_TEST_POS      (16U)
#define USB_PORT_TEST_LEN      (4U)
#define USB_PORT_TEST_MSK      (((1U << USB_PORT_TEST_LEN) - 1) << USB_PORT_TEST_POS)
#define USB_PORT_TEST_UMSK     (~(((1U << USB_PORT_TEST_LEN) - 1) << USB_PORT_TEST_POS))
#define USB_HC_TST_PKDONE      USB_HC_TST_PKDONE
#define USB_HC_TST_PKDONE_POS  (20U)
#define USB_HC_TST_PKDONE_LEN  (1U)
#define USB_HC_TST_PKDONE_MSK  (((1U << USB_HC_TST_PKDONE_LEN) - 1) << USB_HC_TST_PKDONE_POS)
#define USB_HC_TST_PKDONE_UMSK (~(((1U << USB_HC_TST_PKDONE_LEN) - 1) << USB_HC_TST_PKDONE_POS))

/* 0x040 : HCMISC */
#define USB_HCMISC_OFFSET        (0x040)
#define USB_ASYN_SCH_SLPT        USB_ASYN_SCH_SLPT
#define USB_ASYN_SCH_SLPT_POS    (0U)
#define USB_ASYN_SCH_SLPT_LEN    (2U)
#define USB_ASYN_SCH_SLPT_MSK    (((1U << USB_ASYN_SCH_SLPT_LEN) - 1) << USB_ASYN_SCH_SLPT_POS)
#define USB_ASYN_SCH_SLPT_UMSK   (~(((1U << USB_ASYN_SCH_SLPT_LEN) - 1) << USB_ASYN_SCH_SLPT_POS))
#define USB_EOF1_TIME            USB_EOF1_TIME
#define USB_EOF1_TIME_POS        (2U)
#define USB_EOF1_TIME_LEN        (2U)
#define USB_EOF1_TIME_MSK        (((1U << USB_EOF1_TIME_LEN) - 1) << USB_EOF1_TIME_POS)
#define USB_EOF1_TIME_UMSK       (~(((1U << USB_EOF1_TIME_LEN) - 1) << USB_EOF1_TIME_POS))
#define USB_EOF2_TIME            USB_EOF2_TIME
#define USB_EOF2_TIME_POS        (4U)
#define USB_EOF2_TIME_LEN        (2U)
#define USB_EOF2_TIME_MSK        (((1U << USB_EOF2_TIME_LEN) - 1) << USB_EOF2_TIME_POS)
#define USB_EOF2_TIME_UMSK       (~(((1U << USB_EOF2_TIME_LEN) - 1) << USB_EOF2_TIME_POS))
#define USB_HOSTPHY_SUSPEND      USB_HOSTPHY_SUSPEND
#define USB_HOSTPHY_SUSPEND_POS  (6U)
#define USB_HOSTPHY_SUSPEND_LEN  (1U)
#define USB_HOSTPHY_SUSPEND_MSK  (((1U << USB_HOSTPHY_SUSPEND_LEN) - 1) << USB_HOSTPHY_SUSPEND_POS)
#define USB_HOSTPHY_SUSPEND_UMSK (~(((1U << USB_HOSTPHY_SUSPEND_LEN) - 1) << USB_HOSTPHY_SUSPEND_POS))
#define USB_HC_WKP_DET_EN        USB_HC_WKP_DET_EN
#define USB_HC_WKP_DET_EN_POS    (8U)
#define USB_HC_WKP_DET_EN_LEN    (1U)
#define USB_HC_WKP_DET_EN_MSK    (((1U << USB_HC_WKP_DET_EN_LEN) - 1) << USB_HC_WKP_DET_EN_POS)
#define USB_HC_WKP_DET_EN_UMSK   (~(((1U << USB_HC_WKP_DET_EN_LEN) - 1) << USB_HC_WKP_DET_EN_POS))
#define USB_HC_CONN_DET_EN       USB_HC_CONN_DET_EN
#define USB_HC_CONN_DET_EN_POS   (9U)
#define USB_HC_CONN_DET_EN_LEN   (1U)
#define USB_HC_CONN_DET_EN_MSK   (((1U << USB_HC_CONN_DET_EN_LEN) - 1) << USB_HC_CONN_DET_EN_POS)
#define USB_HC_CONN_DET_EN_UMSK  (~(((1U << USB_HC_CONN_DET_EN_LEN) - 1) << USB_HC_CONN_DET_EN_POS))

