RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/usb_reg.h
/* 0x044 : FS_EOF */
#define USB_FS_EOF_OFFSET           (0x044)
#define USB_FS_EOF1_TIME            USB_FS_EOF1_TIME
#define USB_FS_EOF1_TIME_POS        (0U)
#define USB_FS_EOF1_TIME_LEN        (12U)
#define USB_FS_EOF1_TIME_MSK        (((1U << USB_FS_EOF1_TIME_LEN) - 1) << USB_FS_EOF1_TIME_POS)
#define USB_FS_EOF1_TIME_UMSK       (~(((1U << USB_FS_EOF1_TIME_LEN) - 1) << USB_FS_EOF1_TIME_POS))
#define USB_FS_EOF1_TIME_125US      USB_FS_EOF1_TIME_125US
#define USB_FS_EOF1_TIME_125US_POS  (12U)
#define USB_FS_EOF1_TIME_125US_LEN  (3U)
#define USB_FS_EOF1_TIME_125US_MSK  (((1U << USB_FS_EOF1_TIME_125US_LEN) - 1) << USB_FS_EOF1_TIME_125US_POS)
#define USB_FS_EOF1_TIME_125US_UMSK (~(((1U << USB_FS_EOF1_TIME_125US_LEN) - 1) << USB_FS_EOF1_TIME_125US_POS))
#define USB_ITDDMASM                USB_ITDDMASM
#define USB_ITDDMASM_POS            (16U)
#define USB_ITDDMASM_LEN            (4U)
#define USB_ITDDMASM_MSK            (((1U << USB_ITDDMASM_LEN) - 1) << USB_ITDDMASM_POS)
#define USB_ITDDMASM_UMSK           (~(((1U << USB_ITDDMASM_LEN) - 1) << USB_ITDDMASM_POS))
#define USB_ITDTRAVSM               USB_ITDTRAVSM
#define USB_ITDTRAVSM_POS           (20U)
#define USB_ITDTRAVSM_LEN           (2U)
#define USB_ITDTRAVSM_MSK           (((1U << USB_ITDTRAVSM_LEN) - 1) << USB_ITDTRAVSM_POS)
#define USB_ITDTRAVSM_UMSK          (~(((1U << USB_ITDTRAVSM_LEN) - 1) << USB_ITDTRAVSM_POS))
#define USB_DMADMSM                 USB_DMADMSM
#define USB_DMADMSM_POS             (22U)
#define USB_DMADMSM_LEN             (4U)
#define USB_DMADMSM_MSK             (((1U << USB_DMADMSM_LEN) - 1) << USB_DMADMSM_POS)
#define USB_DMADMSM_UMSK            (~(((1U << USB_DMADMSM_LEN) - 1) << USB_DMADMSM_POS))
#define USB_QHTTRSM                 USB_QHTTRSM
#define USB_QHTTRSM_POS             (26U)
#define USB_QHTTRSM_LEN             (3U)
#define USB_QHTTRSM_MSK             (((1U << USB_QHTTRSM_LEN) - 1) << USB_QHTTRSM_POS)
#define USB_QHTTRSM_UMSK            (~(((1U << USB_QHTTRSM_LEN) - 1) << USB_QHTTRSM_POS))
#define USB_QHTRAVSM                USB_QHTRAVSM
#define USB_QHTRAVSM_POS            (29U)
#define USB_QHTRAVSM_LEN            (3U)
#define USB_QHTRAVSM_MSK            (((1U << USB_QHTRAVSM_LEN) - 1) << USB_QHTRAVSM_POS)
#define USB_QHTRAVSM_UMSK           (~(((1U << USB_QHTRAVSM_LEN) - 1) << USB_QHTRAVSM_POS))

/* 0x048 : HS_EOF */
#define USB_HS_EOF_OFFSET     (0x048)
#define USB_HS_EOF1_TIME      USB_HS_EOF1_TIME
#define USB_HS_EOF1_TIME_POS  (0U)
#define USB_HS_EOF1_TIME_LEN  (12U)
#define USB_HS_EOF1_TIME_MSK  (((1U << USB_HS_EOF1_TIME_LEN) - 1) << USB_HS_EOF1_TIME_POS)
#define USB_HS_EOF1_TIME_UMSK (~(((1U << USB_HS_EOF1_TIME_LEN) - 1) << USB_HS_EOF1_TIME_POS))
#define USB_SITDDMASM         USB_SITDDMASM
#define USB_SITDDMASM_POS     (16U)
#define USB_SITDDMASM_LEN     (4U)
#define USB_SITDDMASM_MSK     (((1U << USB_SITDDMASM_LEN) - 1) << USB_SITDDMASM_POS)
#define USB_SITDDMASM_UMSK    (~(((1U << USB_SITDDMASM_LEN) - 1) << USB_SITDDMASM_POS))
#define USB_SITDTRAVSM        USB_SITDTRAVSM
#define USB_SITDTRAVSM_POS    (20U)
#define USB_SITDTRAVSM_LEN    (2U)
#define USB_SITDTRAVSM_MSK    (((1U << USB_SITDTRAVSM_LEN) - 1) << USB_SITDTRAVSM_POS)
#define USB_SITDTRAVSM_UMSK   (~(((1U << USB_SITDTRAVSM_LEN) - 1) << USB_SITDTRAVSM_POS))

/* 0x080 : OTG_CSR */
#define USB_OTG_CSR_OFFSET            (0x080)
#define USB_B_BUS_REQ                 USB_B_BUS_REQ
#define USB_B_BUS_REQ_POS             (0U)
#define USB_B_BUS_REQ_LEN             (1U)
#define USB_B_BUS_REQ_MSK             (((1U << USB_B_BUS_REQ_LEN) - 1) << USB_B_BUS_REQ_POS)
#define USB_B_BUS_REQ_UMSK            (~(((1U << USB_B_BUS_REQ_LEN) - 1) << USB_B_BUS_REQ_POS))
#define USB_B_HNP_EN                  USB_B_HNP_EN
#define USB_B_HNP_EN_POS              (1U)
#define USB_B_HNP_EN_LEN              (1U)
#define USB_B_HNP_EN_MSK              (((1U << USB_B_HNP_EN_LEN) - 1) << USB_B_HNP_EN_POS)
#define USB_B_HNP_EN_UMSK             (~(((1U << USB_B_HNP_EN_LEN) - 1) << USB_B_HNP_EN_POS))
#define USB_B_DSCHRG_VBUS             USB_B_DSCHRG_VBUS
#define USB_B_DSCHRG_VBUS_POS         (2U)
#define USB_B_DSCHRG_VBUS_LEN         (1U)
#define USB_B_DSCHRG_VBUS_MSK         (((1U << USB_B_DSCHRG_VBUS_LEN) - 1) << USB_B_DSCHRG_VBUS_POS)
#define USB_B_DSCHRG_VBUS_UMSK        (~(((1U << USB_B_DSCHRG_VBUS_LEN) - 1) << USB_B_DSCHRG_VBUS_POS))
#define USB_A_BUS_REQ_HOV             USB_A_BUS_REQ_HOV
#define USB_A_BUS_REQ_HOV_POS         (4U)
#define USB_A_BUS_REQ_HOV_LEN         (1U)
#define USB_A_BUS_REQ_HOV_MSK         (((1U << USB_A_BUS_REQ_HOV_LEN) - 1) << USB_A_BUS_REQ_HOV_POS)
#define USB_A_BUS_REQ_HOV_UMSK        (~(((1U << USB_A_BUS_REQ_HOV_LEN) - 1) << USB_A_BUS_REQ_HOV_POS))
#define USB_A_BUS_DROP_HOV            USB_A_BUS_DROP_HOV
#define USB_A_BUS_DROP_HOV_POS        (5U)
#define USB_A_BUS_DROP_HOV_LEN        (1U)
#define USB_A_BUS_DROP_HOV_MSK        (((1U << USB_A_BUS_DROP_HOV_LEN) - 1) << USB_A_BUS_DROP_HOV_POS)
#define USB_A_BUS_DROP_HOV_UMSK       (~(((1U << USB_A_BUS_DROP_HOV_LEN) - 1) << USB_A_BUS_DROP_HOV_POS))
#define USB_A_SET_B_HNP_EN            USB_A_SET_B_HNP_EN
#define USB_A_SET_B_HNP_EN_POS        (6U)
#define USB_A_SET_B_HNP_EN_LEN        (1U)
#define USB_A_SET_B_HNP_EN_MSK        (((1U << USB_A_SET_B_HNP_EN_LEN) - 1) << USB_A_SET_B_HNP_EN_POS)
#define USB_A_SET_B_HNP_EN_UMSK       (~(((1U << USB_A_SET_B_HNP_EN_LEN) - 1) << USB_A_SET_B_HNP_EN_POS))
#define USB_A_SRP_DET_EN              USB_A_SRP_DET_EN
#define USB_A_SRP_DET_EN_POS          (7U)
#define USB_A_SRP_DET_EN_LEN          (1U)
#define USB_A_SRP_DET_EN_MSK          (((1U << USB_A_SRP_DET_EN_LEN) - 1) << USB_A_SRP_DET_EN_POS)
#define USB_A_SRP_DET_EN_UMSK         (~(((1U << USB_A_SRP_DET_EN_LEN) - 1) << USB_A_SRP_DET_EN_POS))
#define USB_A_SRP_RESP_TYP            USB_A_SRP_RESP_TYP
#define USB_A_SRP_RESP_TYP_POS        (8U)
#define USB_A_SRP_RESP_TYP_LEN        (1U)
#define USB_A_SRP_RESP_TYP_MSK        (((1U << USB_A_SRP_RESP_TYP_LEN) - 1) << USB_A_SRP_RESP_TYP_POS)
#define USB_A_SRP_RESP_TYP_UMSK       (~(((1U << USB_A_SRP_RESP_TYP_LEN) - 1) << USB_A_SRP_RESP_TYP_POS))
#define USB_ID_FLT_SEL                USB_ID_FLT_SEL
#define USB_ID_FLT_SEL_POS            (9U)
#define USB_ID_FLT_SEL_LEN            (1U)
#define USB_ID_FLT_SEL_MSK            (((1U << USB_ID_FLT_SEL_LEN) - 1) << USB_ID_FLT_SEL_POS)
#define USB_ID_FLT_SEL_UMSK           (~(((1U << USB_ID_FLT_SEL_LEN) - 1) << USB_ID_FLT_SEL_POS))
#define USB_VBUS_FLT_SEL_HOV_POV      USB_VBUS_FLT_SEL_HOV_POV
#define USB_VBUS_FLT_SEL_HOV_POV_POS  (10U)
#define USB_VBUS_FLT_SEL_HOV_POV_LEN  (1U)
#define USB_VBUS_FLT_SEL_HOV_POV_MSK  (((1U << USB_VBUS_FLT_SEL_HOV_POV_LEN) - 1) << USB_VBUS_FLT_SEL_HOV_POV_POS)
#define USB_VBUS_FLT_SEL_HOV_POV_UMSK (~(((1U << USB_VBUS_FLT_SEL_HOV_POV_LEN) - 1) << USB_VBUS_FLT_SEL_HOV_POV_POS))
#define USB_HDISCON_FLT_SEL_HOV       USB_HDISCON_FLT_SEL_HOV
#define USB_HDISCON_FLT_SEL_HOV_POS   (11U)
#define USB_HDISCON_FLT_SEL_HOV_LEN   (1U)
#define USB_HDISCON_FLT_SEL_HOV_MSK   (((1U << USB_HDISCON_FLT_SEL_HOV_LEN) - 1) << USB_HDISCON_FLT_SEL_HOV_POS)
#define USB_HDISCON_FLT_SEL_HOV_UMSK  (~(((1U << USB_HDISCON_FLT_SEL_HOV_LEN) - 1) << USB_HDISCON_FLT_SEL_HOV_POS))
#define USB_IDPULUP_HOV_POV           USB_IDPULUP_HOV_POV
#define USB_IDPULUP_HOV_POV_POS       (13U)
#define USB_IDPULUP_HOV_POV_LEN       (1U)
#define USB_IDPULUP_HOV_POV_MSK       (((1U << USB_IDPULUP_HOV_POV_LEN) - 1) << USB_IDPULUP_HOV_POV_POS)
#define USB_IDPULUP_HOV_POV_UMSK      (~(((1U << USB_IDPULUP_HOV_POV_LEN) - 1) << USB_IDPULUP_HOV_POV_POS))
#define USB_B_SESS_END_POV            USB_B_SESS_END_POV
#define USB_B_SESS_END_POV_POS        (16U)
#define USB_B_SESS_END_POV_LEN        (1U)
#define USB_B_SESS_END_POV_MSK        (((1U << USB_B_SESS_END_POV_LEN) - 1) << USB_B_SESS_END_POV_POS)
#define USB_B_SESS_END_POV_UMSK       (~(((1U << USB_B_SESS_END_POV_LEN) - 1) << USB_B_SESS_END_POV_POS))
#define USB_B_SESS_VLD_POV            USB_B_SESS_VLD_POV
#define USB_B_SESS_VLD_POV_POS        (17U)
#define USB_B_SESS_VLD_POV_LEN        (1U)
#define USB_B_SESS_VLD_POV_MSK        (((1U << USB_B_SESS_VLD_POV_LEN) - 1) << USB_B_SESS_VLD_POV_POS)
#define USB_B_SESS_VLD_POV_UMSK       (~(((1U << USB_B_SESS_VLD_POV_LEN) - 1) << USB_B_SESS_VLD_POV_POS))
#define USB_A_SESS_VLD                USB_A_SESS_VLD
#define USB_A_SESS_VLD_POS            (18U)
#define USB_A_SESS_VLD_LEN            (1U)
#define USB_A_SESS_VLD_MSK            (((1U << USB_A_SESS_VLD_LEN) - 1) << USB_A_SESS_VLD_POS)
#define USB_A_SESS_VLD_UMSK           (~(((1U << USB_A_SESS_VLD_LEN) - 1) << USB_A_SESS_VLD_POS))
#define USB_VBUS_VLD_HOV              USB_VBUS_VLD_HOV
#define USB_VBUS_VLD_HOV_POS          (19U)
#define USB_VBUS_VLD_HOV_LEN          (1U)
#define USB_VBUS_VLD_HOV_MSK          (((1U << USB_VBUS_VLD_HOV_LEN) - 1) << USB_VBUS_VLD_HOV_POS)
#define USB_VBUS_VLD_HOV_UMSK         (~(((1U << USB_VBUS_VLD_HOV_LEN) - 1) << USB_VBUS_VLD_HOV_POS))
#define USB_CROLE_HOV_POV             USB_CROLE_HOV_POV
#define USB_CROLE_HOV_POV_POS         (20U)
#define USB_CROLE_HOV_POV_LEN         (1U)
#define USB_CROLE_HOV_POV_MSK         (((1U << USB_CROLE_HOV_POV_LEN) - 1) << USB_CROLE_HOV_POV_POS)
#define USB_CROLE_HOV_POV_UMSK        (~(((1U << USB_CROLE_HOV_POV_LEN) - 1) << USB_CROLE_HOV_POV_POS))
#define USB_ID_HOV_POV                USB_ID_HOV_POV
#define USB_ID_HOV_POV_POS            (21U)
#define USB_ID_HOV_POV_LEN            (1U)
#define USB_ID_HOV_POV_MSK            (((1U << USB_ID_HOV_POV_LEN) - 1) << USB_ID_HOV_POV_POS)
#define USB_ID_HOV_POV_UMSK           (~(((1U << USB_ID_HOV_POV_LEN) - 1) << USB_ID_HOV_POV_POS))
#define USB_SPD_TYP_HOV_POV           USB_SPD_TYP_HOV_POV
#define USB_SPD_TYP_HOV_POV_POS       (22U)
#define USB_SPD_TYP_HOV_POV_LEN       (2U)
#define USB_SPD_TYP_HOV_POV_MSK       (((1U << USB_SPD_TYP_HOV_POV_LEN) - 1) << USB_SPD_TYP_HOV_POV_POS)
#define USB_SPD_TYP_HOV_POV_UMSK      (~(((1U << USB_SPD_TYP_HOV_POV_LEN) - 1) << USB_SPD_TYP_HOV_POV_POS))

/* 0x084 : OTG_ISR */
#define USB_OTG_ISR_OFFSET          (0x084)
#define USB_B_SRP_DN                USB_B_SRP_DN
#define USB_B_SRP_DN_POS            (0U)
#define USB_B_SRP_DN_LEN            (1U)
#define USB_B_SRP_DN_MSK            (((1U << USB_B_SRP_DN_LEN) - 1) << USB_B_SRP_DN_POS)
#define USB_B_SRP_DN_UMSK           (~(((1U << USB_B_SRP_DN_LEN) - 1) << USB_B_SRP_DN_POS))
#define USB_A_SRP_DET               USB_A_SRP_DET
#define USB_A_SRP_DET_POS           (4U)
#define USB_A_SRP_DET_LEN           (1U)
#define USB_A_SRP_DET_MSK           (((1U << USB_A_SRP_DET_LEN) - 1) << USB_A_SRP_DET_POS)
#define USB_A_SRP_DET_UMSK          (~(((1U << USB_A_SRP_DET_LEN) - 1) << USB_A_SRP_DET_POS))
#define USB_A_VBUS_ERR_HOV          USB_A_VBUS_ERR_HOV
#define USB_A_VBUS_ERR_HOV_POS      (5U)
#define USB_A_VBUS_ERR_HOV_LEN      (1U)
#define USB_A_VBUS_ERR_HOV_MSK      (((1U << USB_A_VBUS_ERR_HOV_LEN) - 1) << USB_A_VBUS_ERR_HOV_POS)
#define USB_A_VBUS_ERR_HOV_UMSK     (~(((1U << USB_A_VBUS_ERR_HOV_LEN) - 1) << USB_A_VBUS_ERR_HOV_POS))
#define USB_B_SESS_END_INT_POV      USB_B_SESS_END_INT_POV
#define USB_B_SESS_END_INT_POV_POS  (6U)
#define USB_B_SESS_END_INT_POV_LEN  (1U)
#define USB_B_SESS_END_INT_POV_MSK  (((1U << USB_B_SESS_END_INT_POV_LEN) - 1) << USB_B_SESS_END_INT_POV_POS)
#define USB_B_SESS_END_INT_POV_UMSK (~(((1U << USB_B_SESS_END_INT_POV_LEN) - 1) << USB_B_SESS_END_INT_POV_POS))
#define USB_RLCHG                   USB_RLCHG
#define USB_RLCHG_POS               (8U)
#define USB_RLCHG_LEN               (1U)
#define USB_RLCHG_MSK               (((1U << USB_RLCHG_LEN) - 1) << USB_RLCHG_POS)
#define USB_RLCHG_UMSK              (~(((1U << USB_RLCHG_LEN) - 1) << USB_RLCHG_POS))
#define USB_IDCHG                   USB_IDCHG
#define USB_IDCHG_POS               (9U)
#define USB_IDCHG_LEN               (1U)
#define USB_IDCHG_MSK               (((1U << USB_IDCHG_LEN) - 1) << USB_IDCHG_POS)
#define USB_IDCHG_UMSK              (~(((1U << USB_IDCHG_LEN) - 1) << USB_IDCHG_POS))
#define USB_OVC_HOV                 USB_OVC_HOV
#define USB_OVC_HOV_POS             (10U)
#define USB_OVC_HOV_LEN             (1U)
#define USB_OVC_HOV_MSK             (((1U << USB_OVC_HOV_LEN) - 1) << USB_OVC_HOV_POS)
#define USB_OVC_HOV_UMSK            (~(((1U << USB_OVC_HOV_LEN) - 1) << USB_OVC_HOV_POS))
#define USB_A_WAIT_CON_HOV          USB_A_WAIT_CON_HOV
#define USB_A_WAIT_CON_HOV_POS      (11U)
#define USB_A_WAIT_CON_HOV_LEN      (1U)
#define USB_A_WAIT_CON_HOV_MSK      (((1U << USB_A_WAIT_CON_HOV_LEN) - 1) << USB_A_WAIT_CON_HOV_POS)
#define USB_A_WAIT_CON_HOV_UMSK     (~(((1U << USB_A_WAIT_CON_HOV_LEN) - 1) << USB_A_WAIT_CON_HOV_POS))
#define USB_APLGRMV                 USB_APLGRMV
#define USB_APLGRMV_POS             (12U)
#define USB_APLGRMV_LEN             (1U)
#define USB_APLGRMV_MSK             (((1U << USB_APLGRMV_LEN) - 1) << USB_APLGRMV_POS)
#define USB_APLGRMV_UMSK            (~(((1U << USB_APLGRMV_LEN) - 1) << USB_APLGRMV_POS))

/* 0x088 : OTG_IER */
#define USB_OTG_IER_OFFSET         (0x088)
#define USB_B_SRP_DN_EN            USB_B_SRP_DN_EN
#define USB_B_SRP_DN_EN_POS        (0U)
#define USB_B_SRP_DN_EN_LEN        (1U)
#define USB_B_SRP_DN_EN_MSK        (((1U << USB_B_SRP_DN_EN_LEN) - 1) << USB_B_SRP_DN_EN_POS)
#define USB_B_SRP_DN_EN_UMSK       (~(((1U << USB_B_SRP_DN_EN_LEN) - 1) << USB_B_SRP_DN_EN_POS))
#define USB_A_SRP_DET_INT_EN       USB_A_SRP_DET_INT_EN
#define USB_A_SRP_DET_INT_EN_POS   (4U)
#define USB_A_SRP_DET_INT_EN_LEN   (1U)
#define USB_A_SRP_DET_INT_EN_MSK   (((1U << USB_A_SRP_DET_INT_EN_LEN) - 1) << USB_A_SRP_DET_INT_EN_POS)
#define USB_A_SRP_DET_INT_EN_UMSK  (~(((1U << USB_A_SRP_DET_INT_EN_LEN) - 1) << USB_A_SRP_DET_INT_EN_POS))
#define USB_A_VBUS_ERR_EN_HOV      USB_A_VBUS_ERR_EN_HOV
#define USB_A_VBUS_ERR_EN_HOV_POS  (5U)
#define USB_A_VBUS_ERR_EN_HOV_LEN  (1U)
#define USB_A_VBUS_ERR_EN_HOV_MSK  (((1U << USB_A_VBUS_ERR_EN_HOV_LEN) - 1) << USB_A_VBUS_ERR_EN_HOV_POS)
#define USB_A_VBUS_ERR_EN_HOV_UMSK (~(((1U << USB_A_VBUS_ERR_EN_HOV_LEN) - 1) << USB_A_VBUS_ERR_EN_HOV_POS))
#define USB_B_SESS_END_EN_POV      USB_B_SESS_END_EN_POV
#define USB_B_SESS_END_EN_POV_POS  (6U)
#define USB_B_SESS_END_EN_POV_LEN  (1U)
#define USB_B_SESS_END_EN_POV_MSK  (((1U << USB_B_SESS_END_EN_POV_LEN) - 1) << USB_B_SESS_END_EN_POV_POS)
#define USB_B_SESS_END_EN_POV_UMSK (~(((1U << USB_B_SESS_END_EN_POV_LEN) - 1) << USB_B_SESS_END_EN_POV_POS))
#define USB_RLCHG_EN               USB_RLCHG_EN
#define USB_RLCHG_EN_POS           (8U)
#define USB_RLCHG_EN_LEN           (1U)
#define USB_RLCHG_EN_MSK           (((1U << USB_RLCHG_EN_LEN) - 1) << USB_RLCHG_EN_POS)
#define USB_RLCHG_EN_UMSK          (~(((1U << USB_RLCHG_EN_LEN) - 1) << USB_RLCHG_EN_POS))
#define USB_IDCHG_EN               USB_IDCHG_EN
#define USB_IDCHG_EN_POS           (9U)
#define USB_IDCHG_EN_LEN           (1U)
#define USB_IDCHG_EN_MSK           (((1U << USB_IDCHG_EN_LEN) - 1) << USB_IDCHG_EN_POS)
#define USB_IDCHG_EN_UMSK          (~(((1U << USB_IDCHG_EN_LEN) - 1) << USB_IDCHG_EN_POS))
#define USB_OVC_EN_HOV             USB_OVC_EN_HOV
#define USB_OVC_EN_HOV_POS         (10U)
#define USB_OVC_EN_HOV_LEN         (1U)
#define USB_OVC_EN_HOV_MSK         (((1U << USB_OVC_EN_HOV_LEN) - 1) << USB_OVC_EN_HOV_POS)
#define USB_OVC_EN_HOV_UMSK        (~(((1U << USB_OVC_EN_HOV_LEN) - 1) << USB_OVC_EN_HOV_POS))
#define USB_A_WAIT_CON_EN_HOV      USB_A_WAIT_CON_EN_HOV
#define USB_A_WAIT_CON_EN_HOV_POS  (11U)
#define USB_A_WAIT_CON_EN_HOV_LEN  (1U)
#define USB_A_WAIT_CON_EN_HOV_MSK  (((1U << USB_A_WAIT_CON_EN_HOV_LEN) - 1) << USB_A_WAIT_CON_EN_HOV_POS)
#define USB_A_WAIT_CON_EN_HOV_UMSK (~(((1U << USB_A_WAIT_CON_EN_HOV_LEN) - 1) << USB_A_WAIT_CON_EN_HOV_POS))
#define USB_APLGRMV_EN             USB_APLGRMV_EN
#define USB_APLGRMV_EN_POS         (12U)
#define USB_APLGRMV_EN_LEN         (1U)
#define USB_APLGRMV_EN_MSK         (((1U << USB_APLGRMV_EN_LEN) - 1) << USB_APLGRMV_EN_POS)
#define USB_APLGRMV_EN_UMSK        (~(((1U << USB_APLGRMV_EN_LEN) - 1) << USB_APLGRMV_EN_POS))

/* 0x0C0 : GLB_ISR */
#define USB_GLB_ISR_OFFSET (0x0C0)
#define USB_DEV_INT        USB_DEV_INT
#define USB_DEV_INT_POS    (0U)
#define USB_DEV_INT_LEN    (1U)
#define USB_DEV_INT_MSK    (((1U << USB_DEV_INT_LEN) - 1) << USB_DEV_INT_POS)
#define USB_DEV_INT_UMSK   (~(((1U << USB_DEV_INT_LEN) - 1) << USB_DEV_INT_POS))
#define USB_OTG_INT        USB_OTG_INT
#define USB_OTG_INT_POS    (1U)
#define USB_OTG_INT_LEN    (1U)
#define USB_OTG_INT_MSK    (((1U << USB_OTG_INT_LEN) - 1) << USB_OTG_INT_POS)
#define USB_OTG_INT_UMSK   (~(((1U << USB_OTG_INT_LEN) - 1) << USB_OTG_INT_POS))
#define USB_HC_INT         USB_HC_INT
#define USB_HC_INT_POS     (2U)
#define USB_HC_INT_LEN     (1U)
#define USB_HC_INT_MSK     (((1U << USB_HC_INT_LEN) - 1) << USB_HC_INT_POS)
#define USB_HC_INT_UMSK    (~(((1U << USB_HC_INT_LEN) - 1) << USB_HC_INT_POS))

/* 0x0C4 : GLB_INT */
#define USB_GLB_INT_OFFSET    (0x0C4)
#define USB_MDEV_INT          USB_MDEV_INT
#define USB_MDEV_INT_POS      (0U)
#define USB_MDEV_INT_LEN      (1U)
#define USB_MDEV_INT_MSK      (((1U << USB_MDEV_INT_LEN) - 1) << USB_MDEV_INT_POS)
#define USB_MDEV_INT_UMSK     (~(((1U << USB_MDEV_INT_LEN) - 1) << USB_MDEV_INT_POS))
#define USB_MOTG_INT          USB_MOTG_INT
#define USB_MOTG_INT_POS      (1U)
#define USB_MOTG_INT_LEN      (1U)
#define USB_MOTG_INT_MSK      (((1U << USB_MOTG_INT_LEN) - 1) << USB_MOTG_INT_POS)
#define USB_MOTG_INT_UMSK     (~(((1U << USB_MOTG_INT_LEN) - 1) << USB_MOTG_INT_POS))
#define USB_MHC_INT           USB_MHC_INT
#define USB_MHC_INT_POS       (2U)
#define USB_MHC_INT_LEN       (1U)
#define USB_MHC_INT_MSK       (((1U << USB_MHC_INT_LEN) - 1) << USB_MHC_INT_POS)
#define USB_MHC_INT_UMSK      (~(((1U << USB_MHC_INT_LEN) - 1) << USB_MHC_INT_POS))
#define USB_INT_POLARITY      USB_INT_POLARITY
#define USB_INT_POLARITY_POS  (3U)
#define USB_INT_POLARITY_LEN  (1U)
#define USB_INT_POLARITY_MSK  (((1U << USB_INT_POLARITY_LEN) - 1) << USB_INT_POLARITY_POS)
#define USB_INT_POLARITY_UMSK (~(((1U << USB_INT_POLARITY_LEN) - 1) << USB_INT_POLARITY_POS))

