RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/usb_reg.h
/* 0x0E0 : REVISION */
#define USB_REVISION_OFFSET (0x0E0)
#define USB_REVISION        USB_REVISION
#define USB_REVISION_POS    (0U)
#define USB_REVISION_LEN    (32U)
#define USB_REVISION_MSK    (((1U << USB_REVISION_LEN) - 1) << USB_REVISION_POS)
#define USB_REVISION_UMSK   (~(((1U << USB_REVISION_LEN) - 1) << USB_REVISION_POS))

/* 0x0E4 : FEATURE */
#define USB_FEATURE_OFFSET  (0x0E4)
#define USB_DMABUFSIZE      USB_DMABUFSIZE
#define USB_DMABUFSIZE_POS  (0U)
#define USB_DMABUFSIZE_LEN  (5U)
#define USB_DMABUFSIZE_MSK  (((1U << USB_DMABUFSIZE_LEN) - 1) << USB_DMABUFSIZE_POS)
#define USB_DMABUFSIZE_UMSK (~(((1U << USB_DMABUFSIZE_LEN) - 1) << USB_DMABUFSIZE_POS))
#define USB_FIFO_NUM        USB_FIFO_NUM
#define USB_FIFO_NUM_POS    (5U)
#define USB_FIFO_NUM_LEN    (5U)
#define USB_FIFO_NUM_MSK    (((1U << USB_FIFO_NUM_LEN) - 1) << USB_FIFO_NUM_POS)
#define USB_FIFO_NUM_UMSK   (~(((1U << USB_FIFO_NUM_LEN) - 1) << USB_FIFO_NUM_POS))
#define USB_EP_NUM          USB_EP_NUM
#define USB_EP_NUM_POS      (10U)
#define USB_EP_NUM_LEN      (5U)
#define USB_EP_NUM_MSK      (((1U << USB_EP_NUM_LEN) - 1) << USB_EP_NUM_POS)
#define USB_EP_NUM_UMSK     (~(((1U << USB_EP_NUM_LEN) - 1) << USB_EP_NUM_POS))
#define USB_DEV_ONLY        USB_DEV_ONLY
#define USB_DEV_ONLY_POS    (15U)
#define USB_DEV_ONLY_LEN    (1U)
#define USB_DEV_ONLY_MSK    (((1U << USB_DEV_ONLY_LEN) - 1) << USB_DEV_ONLY_POS)
#define USB_DEV_ONLY_UMSK   (~(((1U << USB_DEV_ONLY_LEN) - 1) << USB_DEV_ONLY_POS))
#define USB_HOST_ONLY       USB_HOST_ONLY
#define USB_HOST_ONLY_POS   (16U)
#define USB_HOST_ONLY_LEN   (1U)
#define USB_HOST_ONLY_MSK   (((1U << USB_HOST_ONLY_LEN) - 1) << USB_HOST_ONLY_POS)
#define USB_HOST_ONLY_UMSK  (~(((1U << USB_HOST_ONLY_LEN) - 1) << USB_HOST_ONLY_POS))

/* 0x0E8 : AXI_CR */
#define USB_AXI_CR_OFFSET   (0x0E8)
#define USB_AXI_SGLBST      USB_AXI_SGLBST
#define USB_AXI_SGLBST_POS  (0U)
#define USB_AXI_SGLBST_LEN  (1U)
#define USB_AXI_SGLBST_MSK  (((1U << USB_AXI_SGLBST_LEN) - 1) << USB_AXI_SGLBST_POS)
#define USB_AXI_SGLBST_UMSK (~(((1U << USB_AXI_SGLBST_LEN) - 1) << USB_AXI_SGLBST_POS))

/* 0x100 : DEV_CTL */
#define USB_DEV_CTL_OFFSET         (0x100)
#define USB_CAP_RMWAKUP            USB_CAP_RMWAKUP
#define USB_CAP_RMWAKUP_POS        (0U)
#define USB_CAP_RMWAKUP_LEN        (1U)
#define USB_CAP_RMWAKUP_MSK        (((1U << USB_CAP_RMWAKUP_LEN) - 1) << USB_CAP_RMWAKUP_POS)
#define USB_CAP_RMWAKUP_UMSK       (~(((1U << USB_CAP_RMWAKUP_LEN) - 1) << USB_CAP_RMWAKUP_POS))
#define USB_HALF_SPEED_HOV         USB_HALF_SPEED_HOV
#define USB_HALF_SPEED_HOV_POS     (1U)
#define USB_HALF_SPEED_HOV_LEN     (1U)
#define USB_HALF_SPEED_HOV_MSK     (((1U << USB_HALF_SPEED_HOV_LEN) - 1) << USB_HALF_SPEED_HOV_POS)
#define USB_HALF_SPEED_HOV_UMSK    (~(((1U << USB_HALF_SPEED_HOV_LEN) - 1) << USB_HALF_SPEED_HOV_POS))
#define USB_GLINT_EN_HOV           USB_GLINT_EN_HOV
#define USB_GLINT_EN_HOV_POS       (2U)
#define USB_GLINT_EN_HOV_LEN       (1U)
#define USB_GLINT_EN_HOV_MSK       (((1U << USB_GLINT_EN_HOV_LEN) - 1) << USB_GLINT_EN_HOV_POS)
#define USB_GLINT_EN_HOV_UMSK      (~(((1U << USB_GLINT_EN_HOV_LEN) - 1) << USB_GLINT_EN_HOV_POS))
#define USB_GOSUSP                 USB_GOSUSP
#define USB_GOSUSP_POS             (3U)
#define USB_GOSUSP_LEN             (1U)
#define USB_GOSUSP_MSK             (((1U << USB_GOSUSP_LEN) - 1) << USB_GOSUSP_POS)
#define USB_GOSUSP_UMSK            (~(((1U << USB_GOSUSP_LEN) - 1) << USB_GOSUSP_POS))
#define USB_SFRST_HOV              USB_SFRST_HOV
#define USB_SFRST_HOV_POS          (4U)
#define USB_SFRST_HOV_LEN          (1U)
#define USB_SFRST_HOV_MSK          (((1U << USB_SFRST_HOV_LEN) - 1) << USB_SFRST_HOV_POS)
#define USB_SFRST_HOV_UMSK         (~(((1U << USB_SFRST_HOV_LEN) - 1) << USB_SFRST_HOV_POS))
#define USB_CHIP_EN_HOV            USB_CHIP_EN_HOV
#define USB_CHIP_EN_HOV_POS        (5U)
#define USB_CHIP_EN_HOV_LEN        (1U)
#define USB_CHIP_EN_HOV_MSK        (((1U << USB_CHIP_EN_HOV_LEN) - 1) << USB_CHIP_EN_HOV_POS)
#define USB_CHIP_EN_HOV_UMSK       (~(((1U << USB_CHIP_EN_HOV_LEN) - 1) << USB_CHIP_EN_HOV_POS))
#define USB_HS_EN_HOV              USB_HS_EN_HOV
#define USB_HS_EN_HOV_POS          (6U)
#define USB_HS_EN_HOV_LEN          (1U)
#define USB_HS_EN_HOV_MSK          (((1U << USB_HS_EN_HOV_LEN) - 1) << USB_HS_EN_HOV_POS)
#define USB_HS_EN_HOV_UMSK         (~(((1U << USB_HS_EN_HOV_LEN) - 1) << USB_HS_EN_HOV_POS))
#define USB_SYSBUS_WIDTH_HOV       USB_SYSBUS_WIDTH_HOV
#define USB_SYSBUS_WIDTH_HOV_POS   (7U)
#define USB_SYSBUS_WIDTH_HOV_LEN   (1U)
#define USB_SYSBUS_WIDTH_HOV_MSK   (((1U << USB_SYSBUS_WIDTH_HOV_LEN) - 1) << USB_SYSBUS_WIDTH_HOV_POS)
#define USB_SYSBUS_WIDTH_HOV_UMSK  (~(((1U << USB_SYSBUS_WIDTH_HOV_LEN) - 1) << USB_SYSBUS_WIDTH_HOV_POS))
#define USB_FORCE_FS               USB_FORCE_FS
#define USB_FORCE_FS_POS           (9U)
#define USB_FORCE_FS_LEN           (1U)
#define USB_FORCE_FS_MSK           (((1U << USB_FORCE_FS_LEN) - 1) << USB_FORCE_FS_POS)
#define USB_FORCE_FS_UMSK          (~(((1U << USB_FORCE_FS_LEN) - 1) << USB_FORCE_FS_POS))
#define USB_IDLE_DEGLITCH_HOV      USB_IDLE_DEGLITCH_HOV
#define USB_IDLE_DEGLITCH_HOV_POS  (10U)
#define USB_IDLE_DEGLITCH_HOV_LEN  (2U)
#define USB_IDLE_DEGLITCH_HOV_MSK  (((1U << USB_IDLE_DEGLITCH_HOV_LEN) - 1) << USB_IDLE_DEGLITCH_HOV_POS)
#define USB_IDLE_DEGLITCH_HOV_UMSK (~(((1U << USB_IDLE_DEGLITCH_HOV_LEN) - 1) << USB_IDLE_DEGLITCH_HOV_POS))
#define USB_LPM_BESL_MAX           USB_LPM_BESL_MAX
#define USB_LPM_BESL_MAX_POS       (12U)
#define USB_LPM_BESL_MAX_LEN       (4U)
#define USB_LPM_BESL_MAX_MSK       (((1U << USB_LPM_BESL_MAX_LEN) - 1) << USB_LPM_BESL_MAX_POS)
#define USB_LPM_BESL_MAX_UMSK      (~(((1U << USB_LPM_BESL_MAX_LEN) - 1) << USB_LPM_BESL_MAX_POS))
#define USB_LPM_BESL_MIN           USB_LPM_BESL_MIN
#define USB_LPM_BESL_MIN_POS       (16U)
#define USB_LPM_BESL_MIN_LEN       (4U)
#define USB_LPM_BESL_MIN_MSK       (((1U << USB_LPM_BESL_MIN_LEN) - 1) << USB_LPM_BESL_MIN_POS)
#define USB_LPM_BESL_MIN_UMSK      (~(((1U << USB_LPM_BESL_MIN_LEN) - 1) << USB_LPM_BESL_MIN_POS))
#define USB_LPM_BESL               USB_LPM_BESL
#define USB_LPM_BESL_POS           (20U)
#define USB_LPM_BESL_LEN           (4U)
#define USB_LPM_BESL_MSK           (((1U << USB_LPM_BESL_LEN) - 1) << USB_LPM_BESL_POS)
#define USB_LPM_BESL_UMSK          (~(((1U << USB_LPM_BESL_LEN) - 1) << USB_LPM_BESL_POS))
#define USB_LPM_EN                 USB_LPM_EN
#define USB_LPM_EN_POS             (25U)
#define USB_LPM_EN_LEN             (1U)
#define USB_LPM_EN_MSK             (((1U << USB_LPM_EN_LEN) - 1) << USB_LPM_EN_POS)
#define USB_LPM_EN_UMSK            (~(((1U << USB_LPM_EN_LEN) - 1) << USB_LPM_EN_POS))
#define USB_LPM_ACCEPT             USB_LPM_ACCEPT
#define USB_LPM_ACCEPT_POS         (26U)
#define USB_LPM_ACCEPT_LEN         (1U)
#define USB_LPM_ACCEPT_MSK         (((1U << USB_LPM_ACCEPT_LEN) - 1) << USB_LPM_ACCEPT_POS)
#define USB_LPM_ACCEPT_UMSK        (~(((1U << USB_LPM_ACCEPT_LEN) - 1) << USB_LPM_ACCEPT_POS))

/* 0x104 : DEV_ADR */
#define USB_DEV_ADR_OFFSET (0x104)
#define USB_DEVADR         USB_DEVADR
#define USB_DEVADR_POS     (0U)
#define USB_DEVADR_LEN     (7U)
#define USB_DEVADR_MSK     (((1U << USB_DEVADR_LEN) - 1) << USB_DEVADR_POS)
#define USB_DEVADR_UMSK    (~(((1U << USB_DEVADR_LEN) - 1) << USB_DEVADR_POS))
#define USB_AFT_CONF       USB_AFT_CONF
#define USB_AFT_CONF_POS   (7U)
#define USB_AFT_CONF_LEN   (1U)
#define USB_AFT_CONF_MSK   (((1U << USB_AFT_CONF_LEN) - 1) << USB_AFT_CONF_POS)
#define USB_AFT_CONF_UMSK  (~(((1U << USB_AFT_CONF_LEN) - 1) << USB_AFT_CONF_POS))

