RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/usb_reg.h
/* 0x154 : DEV_TXZ */
#define USB_DEV_TXZ_OFFSET   (0x154)
#define USB_TX0BYTE_EP1      USB_TX0BYTE_EP1
#define USB_TX0BYTE_EP1_POS  (0U)
#define USB_TX0BYTE_EP1_LEN  (1U)
#define USB_TX0BYTE_EP1_MSK  (((1U << USB_TX0BYTE_EP1_LEN) - 1) << USB_TX0BYTE_EP1_POS)
#define USB_TX0BYTE_EP1_UMSK (~(((1U << USB_TX0BYTE_EP1_LEN) - 1) << USB_TX0BYTE_EP1_POS))
#define USB_TX0BYTE_EP2      USB_TX0BYTE_EP2
#define USB_TX0BYTE_EP2_POS  (1U)
#define USB_TX0BYTE_EP2_LEN  (1U)
#define USB_TX0BYTE_EP2_MSK  (((1U << USB_TX0BYTE_EP2_LEN) - 1) << USB_TX0BYTE_EP2_POS)
#define USB_TX0BYTE_EP2_UMSK (~(((1U << USB_TX0BYTE_EP2_LEN) - 1) << USB_TX0BYTE_EP2_POS))
#define USB_TX0BYTE_EP3      USB_TX0BYTE_EP3
#define USB_TX0BYTE_EP3_POS  (2U)
#define USB_TX0BYTE_EP3_LEN  (1U)
#define USB_TX0BYTE_EP3_MSK  (((1U << USB_TX0BYTE_EP3_LEN) - 1) << USB_TX0BYTE_EP3_POS)
#define USB_TX0BYTE_EP3_UMSK (~(((1U << USB_TX0BYTE_EP3_LEN) - 1) << USB_TX0BYTE_EP3_POS))
#define USB_TX0BYTE_EP4      USB_TX0BYTE_EP4
#define USB_TX0BYTE_EP4_POS  (3U)
#define USB_TX0BYTE_EP4_LEN  (1U)
#define USB_TX0BYTE_EP4_MSK  (((1U << USB_TX0BYTE_EP4_LEN) - 1) << USB_TX0BYTE_EP4_POS)
#define USB_TX0BYTE_EP4_UMSK (~(((1U << USB_TX0BYTE_EP4_LEN) - 1) << USB_TX0BYTE_EP4_POS))
#define USB_TX0BYTE_EP5      USB_TX0BYTE_EP5
#define USB_TX0BYTE_EP5_POS  (4U)
#define USB_TX0BYTE_EP5_LEN  (1U)
#define USB_TX0BYTE_EP5_MSK  (((1U << USB_TX0BYTE_EP5_LEN) - 1) << USB_TX0BYTE_EP5_POS)
#define USB_TX0BYTE_EP5_UMSK (~(((1U << USB_TX0BYTE_EP5_LEN) - 1) << USB_TX0BYTE_EP5_POS))
#define USB_TX0BYTE_EP6      USB_TX0BYTE_EP6
#define USB_TX0BYTE_EP6_POS  (5U)
#define USB_TX0BYTE_EP6_LEN  (1U)
#define USB_TX0BYTE_EP6_MSK  (((1U << USB_TX0BYTE_EP6_LEN) - 1) << USB_TX0BYTE_EP6_POS)
#define USB_TX0BYTE_EP6_UMSK (~(((1U << USB_TX0BYTE_EP6_LEN) - 1) << USB_TX0BYTE_EP6_POS))
#define USB_TX0BYTE_EP7      USB_TX0BYTE_EP7
#define USB_TX0BYTE_EP7_POS  (6U)
#define USB_TX0BYTE_EP7_LEN  (1U)
#define USB_TX0BYTE_EP7_MSK  (((1U << USB_TX0BYTE_EP7_LEN) - 1) << USB_TX0BYTE_EP7_POS)
#define USB_TX0BYTE_EP7_UMSK (~(((1U << USB_TX0BYTE_EP7_LEN) - 1) << USB_TX0BYTE_EP7_POS))
#define USB_TX0BYTE_EP8      USB_TX0BYTE_EP8
#define USB_TX0BYTE_EP8_POS  (7U)
#define USB_TX0BYTE_EP8_LEN  (1U)
#define USB_TX0BYTE_EP8_MSK  (((1U << USB_TX0BYTE_EP8_LEN) - 1) << USB_TX0BYTE_EP8_POS)
#define USB_TX0BYTE_EP8_UMSK (~(((1U << USB_TX0BYTE_EP8_LEN) - 1) << USB_TX0BYTE_EP8_POS))

/* 0x158 : DEV_ISE */
#define USB_DEV_ISE_OFFSET       (0x158)
#define USB_ISO_ABT_ERR_EP1      USB_ISO_ABT_ERR_EP1
#define USB_ISO_ABT_ERR_EP1_POS  (0U)
#define USB_ISO_ABT_ERR_EP1_LEN  (1U)
#define USB_ISO_ABT_ERR_EP1_MSK  (((1U << USB_ISO_ABT_ERR_EP1_LEN) - 1) << USB_ISO_ABT_ERR_EP1_POS)
#define USB_ISO_ABT_ERR_EP1_UMSK (~(((1U << USB_ISO_ABT_ERR_EP1_LEN) - 1) << USB_ISO_ABT_ERR_EP1_POS))
#define USB_ISO_ABT_ERR_EP2      USB_ISO_ABT_ERR_EP2
#define USB_ISO_ABT_ERR_EP2_POS  (1U)
#define USB_ISO_ABT_ERR_EP2_LEN  (1U)
#define USB_ISO_ABT_ERR_EP2_MSK  (((1U << USB_ISO_ABT_ERR_EP2_LEN) - 1) << USB_ISO_ABT_ERR_EP2_POS)
#define USB_ISO_ABT_ERR_EP2_UMSK (~(((1U << USB_ISO_ABT_ERR_EP2_LEN) - 1) << USB_ISO_ABT_ERR_EP2_POS))
#define USB_ISO_ABT_ERR_EP3      USB_ISO_ABT_ERR_EP3
#define USB_ISO_ABT_ERR_EP3_POS  (2U)
#define USB_ISO_ABT_ERR_EP3_LEN  (1U)
#define USB_ISO_ABT_ERR_EP3_MSK  (((1U << USB_ISO_ABT_ERR_EP3_LEN) - 1) << USB_ISO_ABT_ERR_EP3_POS)
#define USB_ISO_ABT_ERR_EP3_UMSK (~(((1U << USB_ISO_ABT_ERR_EP3_LEN) - 1) << USB_ISO_ABT_ERR_EP3_POS))
#define USB_ISO_ABT_ERR_EP4      USB_ISO_ABT_ERR_EP4
#define USB_ISO_ABT_ERR_EP4_POS  (3U)
#define USB_ISO_ABT_ERR_EP4_LEN  (1U)
#define USB_ISO_ABT_ERR_EP4_MSK  (((1U << USB_ISO_ABT_ERR_EP4_LEN) - 1) << USB_ISO_ABT_ERR_EP4_POS)
#define USB_ISO_ABT_ERR_EP4_UMSK (~(((1U << USB_ISO_ABT_ERR_EP4_LEN) - 1) << USB_ISO_ABT_ERR_EP4_POS))
#define USB_ISO_ABT_ERR_EP5      USB_ISO_ABT_ERR_EP5
#define USB_ISO_ABT_ERR_EP5_POS  (4U)
#define USB_ISO_ABT_ERR_EP5_LEN  (1U)
#define USB_ISO_ABT_ERR_EP5_MSK  (((1U << USB_ISO_ABT_ERR_EP5_LEN) - 1) << USB_ISO_ABT_ERR_EP5_POS)
#define USB_ISO_ABT_ERR_EP5_UMSK (~(((1U << USB_ISO_ABT_ERR_EP5_LEN) - 1) << USB_ISO_ABT_ERR_EP5_POS))
#define USB_ISO_ABT_ERR_EP6      USB_ISO_ABT_ERR_EP6
#define USB_ISO_ABT_ERR_EP6_POS  (5U)
#define USB_ISO_ABT_ERR_EP6_LEN  (1U)
#define USB_ISO_ABT_ERR_EP6_MSK  (((1U << USB_ISO_ABT_ERR_EP6_LEN) - 1) << USB_ISO_ABT_ERR_EP6_POS)
#define USB_ISO_ABT_ERR_EP6_UMSK (~(((1U << USB_ISO_ABT_ERR_EP6_LEN) - 1) << USB_ISO_ABT_ERR_EP6_POS))
#define USB_ISO_ABT_ERR_EP7      USB_ISO_ABT_ERR_EP7
#define USB_ISO_ABT_ERR_EP7_POS  (6U)
#define USB_ISO_ABT_ERR_EP7_LEN  (1U)
#define USB_ISO_ABT_ERR_EP7_MSK  (((1U << USB_ISO_ABT_ERR_EP7_LEN) - 1) << USB_ISO_ABT_ERR_EP7_POS)
#define USB_ISO_ABT_ERR_EP7_UMSK (~(((1U << USB_ISO_ABT_ERR_EP7_LEN) - 1) << USB_ISO_ABT_ERR_EP7_POS))
#define USB_ISO_ABT_ERR_EP8      USB_ISO_ABT_ERR_EP8
#define USB_ISO_ABT_ERR_EP8_POS  (7U)
#define USB_ISO_ABT_ERR_EP8_LEN  (1U)
#define USB_ISO_ABT_ERR_EP8_MSK  (((1U << USB_ISO_ABT_ERR_EP8_LEN) - 1) << USB_ISO_ABT_ERR_EP8_POS)
#define USB_ISO_ABT_ERR_EP8_UMSK (~(((1U << USB_ISO_ABT_ERR_EP8_LEN) - 1) << USB_ISO_ABT_ERR_EP8_POS))
#define USB_ISO_SEQ_ERR_EP1      USB_ISO_SEQ_ERR_EP1
#define USB_ISO_SEQ_ERR_EP1_POS  (16U)
#define USB_ISO_SEQ_ERR_EP1_LEN  (1U)
#define USB_ISO_SEQ_ERR_EP1_MSK  (((1U << USB_ISO_SEQ_ERR_EP1_LEN) - 1) << USB_ISO_SEQ_ERR_EP1_POS)
#define USB_ISO_SEQ_ERR_EP1_UMSK (~(((1U << USB_ISO_SEQ_ERR_EP1_LEN) - 1) << USB_ISO_SEQ_ERR_EP1_POS))
#define USB_ISO_SEQ_ERR_EP2      USB_ISO_SEQ_ERR_EP2
#define USB_ISO_SEQ_ERR_EP2_POS  (17U)
#define USB_ISO_SEQ_ERR_EP2_LEN  (1U)
#define USB_ISO_SEQ_ERR_EP2_MSK  (((1U << USB_ISO_SEQ_ERR_EP2_LEN) - 1) << USB_ISO_SEQ_ERR_EP2_POS)
#define USB_ISO_SEQ_ERR_EP2_UMSK (~(((1U << USB_ISO_SEQ_ERR_EP2_LEN) - 1) << USB_ISO_SEQ_ERR_EP2_POS))
#define USB_ISO_SEQ_ERR_EP3      USB_ISO_SEQ_ERR_EP3
#define USB_ISO_SEQ_ERR_EP3_POS  (18U)
#define USB_ISO_SEQ_ERR_EP3_LEN  (1U)
#define USB_ISO_SEQ_ERR_EP3_MSK  (((1U << USB_ISO_SEQ_ERR_EP3_LEN) - 1) << USB_ISO_SEQ_ERR_EP3_POS)
#define USB_ISO_SEQ_ERR_EP3_UMSK (~(((1U << USB_ISO_SEQ_ERR_EP3_LEN) - 1) << USB_ISO_SEQ_ERR_EP3_POS))
#define USB_ISO_SEQ_ERR_EP4      USB_ISO_SEQ_ERR_EP4
#define USB_ISO_SEQ_ERR_EP4_POS  (19U)
#define USB_ISO_SEQ_ERR_EP4_LEN  (1U)
#define USB_ISO_SEQ_ERR_EP4_MSK  (((1U << USB_ISO_SEQ_ERR_EP4_LEN) - 1) << USB_ISO_SEQ_ERR_EP4_POS)
#define USB_ISO_SEQ_ERR_EP4_UMSK (~(((1U << USB_ISO_SEQ_ERR_EP4_LEN) - 1) << USB_ISO_SEQ_ERR_EP4_POS))
#define USB_ISO_SEQ_ERR_EP5      USB_ISO_SEQ_ERR_EP5
#define USB_ISO_SEQ_ERR_EP5_POS  (20U)
#define USB_ISO_SEQ_ERR_EP5_LEN  (1U)
#define USB_ISO_SEQ_ERR_EP5_MSK  (((1U << USB_ISO_SEQ_ERR_EP5_LEN) - 1) << USB_ISO_SEQ_ERR_EP5_POS)
#define USB_ISO_SEQ_ERR_EP5_UMSK (~(((1U << USB_ISO_SEQ_ERR_EP5_LEN) - 1) << USB_ISO_SEQ_ERR_EP5_POS))
#define USB_ISO_SEQ_ERR_EP6      USB_ISO_SEQ_ERR_EP6
#define USB_ISO_SEQ_ERR_EP6_POS  (21U)
#define USB_ISO_SEQ_ERR_EP6_LEN  (1U)
#define USB_ISO_SEQ_ERR_EP6_MSK  (((1U << USB_ISO_SEQ_ERR_EP6_LEN) - 1) << USB_ISO_SEQ_ERR_EP6_POS)
#define USB_ISO_SEQ_ERR_EP6_UMSK (~(((1U << USB_ISO_SEQ_ERR_EP6_LEN) - 1) << USB_ISO_SEQ_ERR_EP6_POS))
#define USB_ISO_SEQ_ERR_EP7      USB_ISO_SEQ_ERR_EP7
#define USB_ISO_SEQ_ERR_EP7_POS  (22U)
#define USB_ISO_SEQ_ERR_EP7_LEN  (1U)
#define USB_ISO_SEQ_ERR_EP7_MSK  (((1U << USB_ISO_SEQ_ERR_EP7_LEN) - 1) << USB_ISO_SEQ_ERR_EP7_POS)
#define USB_ISO_SEQ_ERR_EP7_UMSK (~(((1U << USB_ISO_SEQ_ERR_EP7_LEN) - 1) << USB_ISO_SEQ_ERR_EP7_POS))
#define USB_ISO_SEQ_ERR_EP8      USB_ISO_SEQ_ERR_EP8
#define USB_ISO_SEQ_ERR_EP8_POS  (23U)
#define USB_ISO_SEQ_ERR_EP8_LEN  (1U)
#define USB_ISO_SEQ_ERR_EP8_MSK  (((1U << USB_ISO_SEQ_ERR_EP8_LEN) - 1) << USB_ISO_SEQ_ERR_EP8_POS)
#define USB_ISO_SEQ_ERR_EP8_UMSK (~(((1U << USB_ISO_SEQ_ERR_EP8_LEN) - 1) << USB_ISO_SEQ_ERR_EP8_POS))

/* 0x160 : DEV_INMPS1 */
#define USB_DEV_INMPS1_OFFSET    (0x160)
#define USB_MAXPS_IEP1           USB_MAXPS_IEP1
#define USB_MAXPS_IEP1_POS       (0U)
#define USB_MAXPS_IEP1_LEN       (11U)
#define USB_MAXPS_IEP1_MSK       (((1U << USB_MAXPS_IEP1_LEN) - 1) << USB_MAXPS_IEP1_POS)
#define USB_MAXPS_IEP1_UMSK      (~(((1U << USB_MAXPS_IEP1_LEN) - 1) << USB_MAXPS_IEP1_POS))
#define USB_STL_IEP1             USB_STL_IEP1
#define USB_STL_IEP1_POS         (11U)
#define USB_STL_IEP1_LEN         (1U)
#define USB_STL_IEP1_MSK         (((1U << USB_STL_IEP1_LEN) - 1) << USB_STL_IEP1_POS)
#define USB_STL_IEP1_UMSK        (~(((1U << USB_STL_IEP1_LEN) - 1) << USB_STL_IEP1_POS))
#define USB_RSTG_IEP1            USB_RSTG_IEP1
#define USB_RSTG_IEP1_POS        (12U)
#define USB_RSTG_IEP1_LEN        (1U)
#define USB_RSTG_IEP1_MSK        (((1U << USB_RSTG_IEP1_LEN) - 1) << USB_RSTG_IEP1_POS)
#define USB_RSTG_IEP1_UMSK       (~(((1U << USB_RSTG_IEP1_LEN) - 1) << USB_RSTG_IEP1_POS))
#define USB_TX_NUM_HBW_IEP1      USB_TX_NUM_HBW_IEP1
#define USB_TX_NUM_HBW_IEP1_POS  (13U)
#define USB_TX_NUM_HBW_IEP1_LEN  (2U)
#define USB_TX_NUM_HBW_IEP1_MSK  (((1U << USB_TX_NUM_HBW_IEP1_LEN) - 1) << USB_TX_NUM_HBW_IEP1_POS)
#define USB_TX_NUM_HBW_IEP1_UMSK (~(((1U << USB_TX_NUM_HBW_IEP1_LEN) - 1) << USB_TX_NUM_HBW_IEP1_POS))
#define USB_TX0BYTE_IEP1         USB_TX0BYTE_IEP1
#define USB_TX0BYTE_IEP1_POS     (15U)
#define USB_TX0BYTE_IEP1_LEN     (1U)
#define USB_TX0BYTE_IEP1_MSK     (((1U << USB_TX0BYTE_IEP1_LEN) - 1) << USB_TX0BYTE_IEP1_POS)
#define USB_TX0BYTE_IEP1_UMSK    (~(((1U << USB_TX0BYTE_IEP1_LEN) - 1) << USB_TX0BYTE_IEP1_POS))

/* 0x164 : DEV_INMPS2 */
#define USB_DEV_INMPS2_OFFSET    (0x164)
#define USB_MAXPS_IEP2           USB_MAXPS_IEP2
#define USB_MAXPS_IEP2_POS       (0U)
#define USB_MAXPS_IEP2_LEN       (11U)
#define USB_MAXPS_IEP2_MSK       (((1U << USB_MAXPS_IEP2_LEN) - 1) << USB_MAXPS_IEP2_POS)
#define USB_MAXPS_IEP2_UMSK      (~(((1U << USB_MAXPS_IEP2_LEN) - 1) << USB_MAXPS_IEP2_POS))
#define USB_STL_IEP2             USB_STL_IEP2
#define USB_STL_IEP2_POS         (11U)
#define USB_STL_IEP2_LEN         (1U)
#define USB_STL_IEP2_MSK         (((1U << USB_STL_IEP2_LEN) - 1) << USB_STL_IEP2_POS)
#define USB_STL_IEP2_UMSK        (~(((1U << USB_STL_IEP2_LEN) - 1) << USB_STL_IEP2_POS))
#define USB_RSTG_IEP2            USB_RSTG_IEP2
#define USB_RSTG_IEP2_POS        (12U)
#define USB_RSTG_IEP2_LEN        (1U)
#define USB_RSTG_IEP2_MSK        (((1U << USB_RSTG_IEP2_LEN) - 1) << USB_RSTG_IEP2_POS)
#define USB_RSTG_IEP2_UMSK       (~(((1U << USB_RSTG_IEP2_LEN) - 1) << USB_RSTG_IEP2_POS))
#define USB_TX_NUM_HBW_IEP2      USB_TX_NUM_HBW_IEP2
#define USB_TX_NUM_HBW_IEP2_POS  (13U)
#define USB_TX_NUM_HBW_IEP2_LEN  (2U)
#define USB_TX_NUM_HBW_IEP2_MSK  (((1U << USB_TX_NUM_HBW_IEP2_LEN) - 1) << USB_TX_NUM_HBW_IEP2_POS)
#define USB_TX_NUM_HBW_IEP2_UMSK (~(((1U << USB_TX_NUM_HBW_IEP2_LEN) - 1) << USB_TX_NUM_HBW_IEP2_POS))
#define USB_TX0BYTE_IEP2         USB_TX0BYTE_IEP2
#define USB_TX0BYTE_IEP2_POS     (15U)
#define USB_TX0BYTE_IEP2_LEN     (1U)
#define USB_TX0BYTE_IEP2_MSK     (((1U << USB_TX0BYTE_IEP2_LEN) - 1) << USB_TX0BYTE_IEP2_POS)
#define USB_TX0BYTE_IEP2_UMSK    (~(((1U << USB_TX0BYTE_IEP2_LEN) - 1) << USB_TX0BYTE_IEP2_POS))

/* 0x168 : DEV_INMPS3 */
#define USB_DEV_INMPS3_OFFSET    (0x168)
#define USB_MAXPS_IEP3           USB_MAXPS_IEP3
#define USB_MAXPS_IEP3_POS       (0U)
#define USB_MAXPS_IEP3_LEN       (11U)
#define USB_MAXPS_IEP3_MSK       (((1U << USB_MAXPS_IEP3_LEN) - 1) << USB_MAXPS_IEP3_POS)
#define USB_MAXPS_IEP3_UMSK      (~(((1U << USB_MAXPS_IEP3_LEN) - 1) << USB_MAXPS_IEP3_POS))
#define USB_STL_IEP3             USB_STL_IEP3
#define USB_STL_IEP3_POS         (11U)
#define USB_STL_IEP3_LEN         (1U)
#define USB_STL_IEP3_MSK         (((1U << USB_STL_IEP3_LEN) - 1) << USB_STL_IEP3_POS)
#define USB_STL_IEP3_UMSK        (~(((1U << USB_STL_IEP3_LEN) - 1) << USB_STL_IEP3_POS))
#define USB_RSTG_IEP3            USB_RSTG_IEP3
#define USB_RSTG_IEP3_POS        (12U)
#define USB_RSTG_IEP3_LEN        (1U)
#define USB_RSTG_IEP3_MSK        (((1U << USB_RSTG_IEP3_LEN) - 1) << USB_RSTG_IEP3_POS)
#define USB_RSTG_IEP3_UMSK       (~(((1U << USB_RSTG_IEP3_LEN) - 1) << USB_RSTG_IEP3_POS))
#define USB_TX_NUM_HBW_IEP3      USB_TX_NUM_HBW_IEP3
#define USB_TX_NUM_HBW_IEP3_POS  (13U)
#define USB_TX_NUM_HBW_IEP3_LEN  (2U)
#define USB_TX_NUM_HBW_IEP3_MSK  (((1U << USB_TX_NUM_HBW_IEP3_LEN) - 1) << USB_TX_NUM_HBW_IEP3_POS)
#define USB_TX_NUM_HBW_IEP3_UMSK (~(((1U << USB_TX_NUM_HBW_IEP3_LEN) - 1) << USB_TX_NUM_HBW_IEP3_POS))
#define USB_TX0BYTE_IEP3         USB_TX0BYTE_IEP3
#define USB_TX0BYTE_IEP3_POS     (15U)
#define USB_TX0BYTE_IEP3_LEN     (1U)
#define USB_TX0BYTE_IEP3_MSK     (((1U << USB_TX0BYTE_IEP3_LEN) - 1) << USB_TX0BYTE_IEP3_POS)
#define USB_TX0BYTE_IEP3_UMSK    (~(((1U << USB_TX0BYTE_IEP3_LEN) - 1) << USB_TX0BYTE_IEP3_POS))

/* 0x16C : DEV_INMPS4 */
#define USB_DEV_INMPS4_OFFSET    (0x16C)
#define USB_MAXPS_IEP4           USB_MAXPS_IEP4
#define USB_MAXPS_IEP4_POS       (0U)
#define USB_MAXPS_IEP4_LEN       (11U)
#define USB_MAXPS_IEP4_MSK       (((1U << USB_MAXPS_IEP4_LEN) - 1) << USB_MAXPS_IEP4_POS)
#define USB_MAXPS_IEP4_UMSK      (~(((1U << USB_MAXPS_IEP4_LEN) - 1) << USB_MAXPS_IEP4_POS))
#define USB_STL_IEP4             USB_STL_IEP4
#define USB_STL_IEP4_POS         (11U)
#define USB_STL_IEP4_LEN         (1U)
#define USB_STL_IEP4_MSK         (((1U << USB_STL_IEP4_LEN) - 1) << USB_STL_IEP4_POS)
#define USB_STL_IEP4_UMSK        (~(((1U << USB_STL_IEP4_LEN) - 1) << USB_STL_IEP4_POS))
#define USB_RSTG_IEP4            USB_RSTG_IEP4
#define USB_RSTG_IEP4_POS        (12U)
#define USB_RSTG_IEP4_LEN        (1U)
#define USB_RSTG_IEP4_MSK        (((1U << USB_RSTG_IEP4_LEN) - 1) << USB_RSTG_IEP4_POS)
#define USB_RSTG_IEP4_UMSK       (~(((1U << USB_RSTG_IEP4_LEN) - 1) << USB_RSTG_IEP4_POS))
#define USB_TX_NUM_HBW_IEP4      USB_TX_NUM_HBW_IEP4
#define USB_TX_NUM_HBW_IEP4_POS  (13U)
#define USB_TX_NUM_HBW_IEP4_LEN  (2U)
#define USB_TX_NUM_HBW_IEP4_MSK  (((1U << USB_TX_NUM_HBW_IEP4_LEN) - 1) << USB_TX_NUM_HBW_IEP4_POS)
#define USB_TX_NUM_HBW_IEP4_UMSK (~(((1U << USB_TX_NUM_HBW_IEP4_LEN) - 1) << USB_TX_NUM_HBW_IEP4_POS))
#define USB_TX0BYTE_IEP4         USB_TX0BYTE_IEP4
#define USB_TX0BYTE_IEP4_POS     (15U)
#define USB_TX0BYTE_IEP4_LEN     (1U)
#define USB_TX0BYTE_IEP4_MSK     (((1U << USB_TX0BYTE_IEP4_LEN) - 1) << USB_TX0BYTE_IEP4_POS)
#define USB_TX0BYTE_IEP4_UMSK    (~(((1U << USB_TX0BYTE_IEP4_LEN) - 1) << USB_TX0BYTE_IEP4_POS))

/* 0x170 : DEV_INMPS5 */
#define USB_DEV_INMPS5_OFFSET    (0x170)
#define USB_MAXPS_IEP5           USB_MAXPS_IEP5
#define USB_MAXPS_IEP5_POS       (0U)
#define USB_MAXPS_IEP5_LEN       (11U)
#define USB_MAXPS_IEP5_MSK       (((1U << USB_MAXPS_IEP5_LEN) - 1) << USB_MAXPS_IEP5_POS)
#define USB_MAXPS_IEP5_UMSK      (~(((1U << USB_MAXPS_IEP5_LEN) - 1) << USB_MAXPS_IEP5_POS))
#define USB_STL_IEP5             USB_STL_IEP5
#define USB_STL_IEP5_POS         (11U)
#define USB_STL_IEP5_LEN         (1U)
#define USB_STL_IEP5_MSK         (((1U << USB_STL_IEP5_LEN) - 1) << USB_STL_IEP5_POS)
#define USB_STL_IEP5_UMSK        (~(((1U << USB_STL_IEP5_LEN) - 1) << USB_STL_IEP5_POS))
#define USB_RSTG_IEP5            USB_RSTG_IEP5
#define USB_RSTG_IEP5_POS        (12U)
#define USB_RSTG_IEP5_LEN        (1U)
#define USB_RSTG_IEP5_MSK        (((1U << USB_RSTG_IEP5_LEN) - 1) << USB_RSTG_IEP5_POS)
#define USB_RSTG_IEP5_UMSK       (~(((1U << USB_RSTG_IEP5_LEN) - 1) << USB_RSTG_IEP5_POS))
#define USB_TX_NUM_HBW_IEP5      USB_TX_NUM_HBW_IEP5
#define USB_TX_NUM_HBW_IEP5_POS  (13U)
#define USB_TX_NUM_HBW_IEP5_LEN  (2U)
#define USB_TX_NUM_HBW_IEP5_MSK  (((1U << USB_TX_NUM_HBW_IEP5_LEN) - 1) << USB_TX_NUM_HBW_IEP5_POS)
#define USB_TX_NUM_HBW_IEP5_UMSK (~(((1U << USB_TX_NUM_HBW_IEP5_LEN) - 1) << USB_TX_NUM_HBW_IEP5_POS))
#define USB_TX0BYTE_IEP5         USB_TX0BYTE_IEP5
#define USB_TX0BYTE_IEP5_POS     (15U)
#define USB_TX0BYTE_IEP5_LEN     (1U)
#define USB_TX0BYTE_IEP5_MSK     (((1U << USB_TX0BYTE_IEP5_LEN) - 1) << USB_TX0BYTE_IEP5_POS)
#define USB_TX0BYTE_IEP5_UMSK    (~(((1U << USB_TX0BYTE_IEP5_LEN) - 1) << USB_TX0BYTE_IEP5_POS))

