RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/usb_reg.h
/* 0x1B0 : DEV_FIBC0 */
#define USB_DEV_FIBC0_OFFSET (0x1B0)
#define USB_BC_F0            USB_BC_F0
#define USB_BC_F0_POS        (0U)
#define USB_BC_F0_LEN        (11U)
#define USB_BC_F0_MSK        (((1U << USB_BC_F0_LEN) - 1) << USB_BC_F0_POS)
#define USB_BC_F0_UMSK       (~(((1U << USB_BC_F0_LEN) - 1) << USB_BC_F0_POS))
#define USB_FFRST0_HOV       USB_FFRST0_HOV
#define USB_FFRST0_HOV_POS   (12U)
#define USB_FFRST0_HOV_LEN   (1U)
#define USB_FFRST0_HOV_MSK   (((1U << USB_FFRST0_HOV_LEN) - 1) << USB_FFRST0_HOV_POS)
#define USB_FFRST0_HOV_UMSK  (~(((1U << USB_FFRST0_HOV_LEN) - 1) << USB_FFRST0_HOV_POS))

/* 0x1B4 : DEV_FIBC1 */
#define USB_DEV_FIBC1_OFFSET (0x1B4)
#define USB_BC_F1            USB_BC_F1
#define USB_BC_F1_POS        (0U)
#define USB_BC_F1_LEN        (11U)
#define USB_BC_F1_MSK        (((1U << USB_BC_F1_LEN) - 1) << USB_BC_F1_POS)
#define USB_BC_F1_UMSK       (~(((1U << USB_BC_F1_LEN) - 1) << USB_BC_F1_POS))
#define USB_FFRST1_HOV       USB_FFRST1_HOV
#define USB_FFRST1_HOV_POS   (12U)
#define USB_FFRST1_HOV_LEN   (1U)
#define USB_FFRST1_HOV_MSK   (((1U << USB_FFRST1_HOV_LEN) - 1) << USB_FFRST1_HOV_POS)
#define USB_FFRST1_HOV_UMSK  (~(((1U << USB_FFRST1_HOV_LEN) - 1) << USB_FFRST1_HOV_POS))

/* 0x1B8 : DEV_FIBC2 */
#define USB_DEV_FIBC2_OFFSET (0x1B8)
#define USB_BC_F2            USB_BC_F2
#define USB_BC_F2_POS        (0U)
#define USB_BC_F2_LEN        (11U)
#define USB_BC_F2_MSK        (((1U << USB_BC_F2_LEN) - 1) << USB_BC_F2_POS)
#define USB_BC_F2_UMSK       (~(((1U << USB_BC_F2_LEN) - 1) << USB_BC_F2_POS))
#define USB_FFRST2_HOV       USB_FFRST2_HOV
#define USB_FFRST2_HOV_POS   (12U)
#define USB_FFRST2_HOV_LEN   (1U)
#define USB_FFRST2_HOV_MSK   (((1U << USB_FFRST2_HOV_LEN) - 1) << USB_FFRST2_HOV_POS)
#define USB_FFRST2_HOV_UMSK  (~(((1U << USB_FFRST2_HOV_LEN) - 1) << USB_FFRST2_HOV_POS))

/* 0x1BC : DEV_FIBC3 */
#define USB_DEV_FIBC3_OFFSET (0x1BC)
#define USB_BC_F3            USB_BC_F3
#define USB_BC_F3_POS        (0U)
#define USB_BC_F3_LEN        (11U)
#define USB_BC_F3_MSK        (((1U << USB_BC_F3_LEN) - 1) << USB_BC_F3_POS)
#define USB_BC_F3_UMSK       (~(((1U << USB_BC_F3_LEN) - 1) << USB_BC_F3_POS))
#define USB_FFRST3_HOV       USB_FFRST3_HOV
#define USB_FFRST3_HOV_POS   (12U)
#define USB_FFRST3_HOV_LEN   (1U)
#define USB_FFRST3_HOV_MSK   (((1U << USB_FFRST3_HOV_LEN) - 1) << USB_FFRST3_HOV_POS)
#define USB_FFRST3_HOV_UMSK  (~(((1U << USB_FFRST3_HOV_LEN) - 1) << USB_FFRST3_HOV_POS))

/* 0x1C0 : DMA_TFN */
#define USB_DMA_TFN_OFFSET   (0x1C0)
#define USB_ACC_F0_HOV       USB_ACC_F0_HOV
#define USB_ACC_F0_HOV_POS   (0U)
#define USB_ACC_F0_HOV_LEN   (1U)
#define USB_ACC_F0_HOV_MSK   (((1U << USB_ACC_F0_HOV_LEN) - 1) << USB_ACC_F0_HOV_POS)
#define USB_ACC_F0_HOV_UMSK  (~(((1U << USB_ACC_F0_HOV_LEN) - 1) << USB_ACC_F0_HOV_POS))
#define USB_ACC_F1_HOV       USB_ACC_F1_HOV
#define USB_ACC_F1_HOV_POS   (1U)
#define USB_ACC_F1_HOV_LEN   (1U)
#define USB_ACC_F1_HOV_MSK   (((1U << USB_ACC_F1_HOV_LEN) - 1) << USB_ACC_F1_HOV_POS)
#define USB_ACC_F1_HOV_UMSK  (~(((1U << USB_ACC_F1_HOV_LEN) - 1) << USB_ACC_F1_HOV_POS))
#define USB_ACC_F2_HOV       USB_ACC_F2_HOV
#define USB_ACC_F2_HOV_POS   (2U)
#define USB_ACC_F2_HOV_LEN   (1U)
#define USB_ACC_F2_HOV_MSK   (((1U << USB_ACC_F2_HOV_LEN) - 1) << USB_ACC_F2_HOV_POS)
#define USB_ACC_F2_HOV_UMSK  (~(((1U << USB_ACC_F2_HOV_LEN) - 1) << USB_ACC_F2_HOV_POS))
#define USB_ACC_F3_HOV       USB_ACC_F3_HOV
#define USB_ACC_F3_HOV_POS   (3U)
#define USB_ACC_F3_HOV_LEN   (1U)
#define USB_ACC_F3_HOV_MSK   (((1U << USB_ACC_F3_HOV_LEN) - 1) << USB_ACC_F3_HOV_POS)
#define USB_ACC_F3_HOV_UMSK  (~(((1U << USB_ACC_F3_HOV_LEN) - 1) << USB_ACC_F3_HOV_POS))
#define USB_ACC_CXF_HOV      USB_ACC_CXF_HOV
#define USB_ACC_CXF_HOV_POS  (4U)
#define USB_ACC_CXF_HOV_LEN  (1U)
#define USB_ACC_CXF_HOV_MSK  (((1U << USB_ACC_CXF_HOV_LEN) - 1) << USB_ACC_CXF_HOV_POS)
#define USB_ACC_CXF_HOV_UMSK (~(((1U << USB_ACC_CXF_HOV_LEN) - 1) << USB_ACC_CXF_HOV_POS))
#define USB_ACC_F4_HOV       USB_ACC_F4_HOV
#define USB_ACC_F4_HOV_POS   (5U)
#define USB_ACC_F4_HOV_LEN   (1U)
#define USB_ACC_F4_HOV_MSK   (((1U << USB_ACC_F4_HOV_LEN) - 1) << USB_ACC_F4_HOV_POS)
#define USB_ACC_F4_HOV_UMSK  (~(((1U << USB_ACC_F4_HOV_LEN) - 1) << USB_ACC_F4_HOV_POS))
#define USB_ACC_F5_HOV       USB_ACC_F5_HOV
#define USB_ACC_F5_HOV_POS   (6U)
#define USB_ACC_F5_HOV_LEN   (1U)
#define USB_ACC_F5_HOV_MSK   (((1U << USB_ACC_F5_HOV_LEN) - 1) << USB_ACC_F5_HOV_POS)
#define USB_ACC_F5_HOV_UMSK  (~(((1U << USB_ACC_F5_HOV_LEN) - 1) << USB_ACC_F5_HOV_POS))
#define USB_ACC_F6_HOV       USB_ACC_F6_HOV
#define USB_ACC_F6_HOV_POS   (7U)
#define USB_ACC_F6_HOV_LEN   (1U)
#define USB_ACC_F6_HOV_MSK   (((1U << USB_ACC_F6_HOV_LEN) - 1) << USB_ACC_F6_HOV_POS)
#define USB_ACC_F6_HOV_UMSK  (~(((1U << USB_ACC_F6_HOV_LEN) - 1) << USB_ACC_F6_HOV_POS))
#define USB_ACC_F7_HOV       USB_ACC_F7_HOV
#define USB_ACC_F7_HOV_POS   (8U)
#define USB_ACC_F7_HOV_LEN   (1U)
#define USB_ACC_F7_HOV_MSK   (((1U << USB_ACC_F7_HOV_LEN) - 1) << USB_ACC_F7_HOV_POS)
#define USB_ACC_F7_HOV_UMSK  (~(((1U << USB_ACC_F7_HOV_LEN) - 1) << USB_ACC_F7_HOV_POS))
#define USB_ACC_F8_HOV       USB_ACC_F8_HOV
#define USB_ACC_F8_HOV_POS   (9U)
#define USB_ACC_F8_HOV_LEN   (1U)
#define USB_ACC_F8_HOV_MSK   (((1U << USB_ACC_F8_HOV_LEN) - 1) << USB_ACC_F8_HOV_POS)
#define USB_ACC_F8_HOV_UMSK  (~(((1U << USB_ACC_F8_HOV_LEN) - 1) << USB_ACC_F8_HOV_POS))
#define USB_ACC_F9_HOV       USB_ACC_F9_HOV
#define USB_ACC_F9_HOV_POS   (10U)
#define USB_ACC_F9_HOV_LEN   (1U)
#define USB_ACC_F9_HOV_MSK   (((1U << USB_ACC_F9_HOV_LEN) - 1) << USB_ACC_F9_HOV_POS)
#define USB_ACC_F9_HOV_UMSK  (~(((1U << USB_ACC_F9_HOV_LEN) - 1) << USB_ACC_F9_HOV_POS))
#define USB_ACC_F10_HOV      USB_ACC_F10_HOV
#define USB_ACC_F10_HOV_POS  (11U)
#define USB_ACC_F10_HOV_LEN  (1U)
#define USB_ACC_F10_HOV_MSK  (((1U << USB_ACC_F10_HOV_LEN) - 1) << USB_ACC_F10_HOV_POS)
#define USB_ACC_F10_HOV_UMSK (~(((1U << USB_ACC_F10_HOV_LEN) - 1) << USB_ACC_F10_HOV_POS))
#define USB_ACC_F11_HOV      USB_ACC_F11_HOV
#define USB_ACC_F11_HOV_POS  (12U)
#define USB_ACC_F11_HOV_LEN  (1U)
#define USB_ACC_F11_HOV_MSK  (((1U << USB_ACC_F11_HOV_LEN) - 1) << USB_ACC_F11_HOV_POS)
#define USB_ACC_F11_HOV_UMSK (~(((1U << USB_ACC_F11_HOV_LEN) - 1) << USB_ACC_F11_HOV_POS))
#define USB_ACC_F12_HOV      USB_ACC_F12_HOV
#define USB_ACC_F12_HOV_POS  (13U)
#define USB_ACC_F12_HOV_LEN  (1U)
#define USB_ACC_F12_HOV_MSK  (((1U << USB_ACC_F12_HOV_LEN) - 1) << USB_ACC_F12_HOV_POS)
#define USB_ACC_F12_HOV_UMSK (~(((1U << USB_ACC_F12_HOV_LEN) - 1) << USB_ACC_F12_HOV_POS))
#define USB_ACC_F13_HOV      USB_ACC_F13_HOV
#define USB_ACC_F13_HOV_POS  (14U)
#define USB_ACC_F13_HOV_LEN  (1U)
#define USB_ACC_F13_HOV_MSK  (((1U << USB_ACC_F13_HOV_LEN) - 1) << USB_ACC_F13_HOV_POS)
#define USB_ACC_F13_HOV_UMSK (~(((1U << USB_ACC_F13_HOV_LEN) - 1) << USB_ACC_F13_HOV_POS))
#define USB_ACC_F14_HOV      USB_ACC_F14_HOV
#define USB_ACC_F14_HOV_POS  (15U)
#define USB_ACC_F14_HOV_LEN  (1U)
#define USB_ACC_F14_HOV_MSK  (((1U << USB_ACC_F14_HOV_LEN) - 1) << USB_ACC_F14_HOV_POS)
#define USB_ACC_F14_HOV_UMSK (~(((1U << USB_ACC_F14_HOV_LEN) - 1) << USB_ACC_F14_HOV_POS))
#define USB_ACC_F15_HOV      USB_ACC_F15_HOV
#define USB_ACC_F15_HOV_POS  (16U)
#define USB_ACC_F15_HOV_LEN  (1U)
#define USB_ACC_F15_HOV_MSK  (((1U << USB_ACC_F15_HOV_LEN) - 1) << USB_ACC_F15_HOV_POS)
#define USB_ACC_F15_HOV_UMSK (~(((1U << USB_ACC_F15_HOV_LEN) - 1) << USB_ACC_F15_HOV_POS))

/* 0x1C4 : DMA_CPS0 */
#define USB_DMA_CPS0_OFFSET    (0x1C4)
#define USB_AWCHACHE_HOV       USB_AWCHACHE_HOV
#define USB_AWCHACHE_HOV_POS   (0U)
#define USB_AWCHACHE_HOV_LEN   (4U)
#define USB_AWCHACHE_HOV_MSK   (((1U << USB_AWCHACHE_HOV_LEN) - 1) << USB_AWCHACHE_HOV_POS)
#define USB_AWCHACHE_HOV_UMSK  (~(((1U << USB_AWCHACHE_HOV_LEN) - 1) << USB_AWCHACHE_HOV_POS))
#define USB_AWPORT_HOV         USB_AWPORT_HOV
#define USB_AWPORT_HOV_POS     (4U)
#define USB_AWPORT_HOV_LEN     (3U)
#define USB_AWPORT_HOV_MSK     (((1U << USB_AWPORT_HOV_LEN) - 1) << USB_AWPORT_HOV_POS)
#define USB_AWPORT_HOV_UMSK    (~(((1U << USB_AWPORT_HOV_LEN) - 1) << USB_AWPORT_HOV_POS))
#define USB_AWLOCK_HOV         USB_AWLOCK_HOV
#define USB_AWLOCK_HOV_POS     (7U)
#define USB_AWLOCK_HOV_LEN     (2U)
#define USB_AWLOCK_HOV_MSK     (((1U << USB_AWLOCK_HOV_LEN) - 1) << USB_AWLOCK_HOV_POS)
#define USB_AWLOCK_HOV_UMSK    (~(((1U << USB_AWLOCK_HOV_LEN) - 1) << USB_AWLOCK_HOV_POS))
#define USB_ARCACHE_HOV        USB_ARCACHE_HOV
#define USB_ARCACHE_HOV_POS    (9U)
#define USB_ARCACHE_HOV_LEN    (4U)
#define USB_ARCACHE_HOV_MSK    (((1U << USB_ARCACHE_HOV_LEN) - 1) << USB_ARCACHE_HOV_POS)
#define USB_ARCACHE_HOV_UMSK   (~(((1U << USB_ARCACHE_HOV_LEN) - 1) << USB_ARCACHE_HOV_POS))
#define USB_ARPORT_HOV         USB_ARPORT_HOV
#define USB_ARPORT_HOV_POS     (13U)
#define USB_ARPORT_HOV_LEN     (3U)
#define USB_ARPORT_HOV_MSK     (((1U << USB_ARPORT_HOV_LEN) - 1) << USB_ARPORT_HOV_POS)
#define USB_ARPORT_HOV_UMSK    (~(((1U << USB_ARPORT_HOV_LEN) - 1) << USB_ARPORT_HOV_POS))
#define USB_ARLOCK_HOV         USB_ARLOCK_HOV
#define USB_ARLOCK_HOV_POS     (16U)
#define USB_ARLOCK_HOV_LEN     (2U)
#define USB_ARLOCK_HOV_MSK     (((1U << USB_ARLOCK_HOV_LEN) - 1) << USB_ARLOCK_HOV_POS)
#define USB_ARLOCK_HOV_UMSK    (~(((1U << USB_ARLOCK_HOV_LEN) - 1) << USB_ARLOCK_HOV_POS))
#define USB_BUF_LD_EN_HOV      USB_BUF_LD_EN_HOV
#define USB_BUF_LD_EN_HOV_POS  (18U)
#define USB_BUF_LD_EN_HOV_LEN  (1U)
#define USB_BUF_LD_EN_HOV_MSK  (((1U << USB_BUF_LD_EN_HOV_LEN) - 1) << USB_BUF_LD_EN_HOV_POS)
#define USB_BUF_LD_EN_HOV_UMSK (~(((1U << USB_BUF_LD_EN_HOV_LEN) - 1) << USB_BUF_LD_EN_HOV_POS))
#define USB_DST_WD_HOV         USB_DST_WD_HOV
#define USB_DST_WD_HOV_POS     (19U)
#define USB_DST_WD_HOV_LEN     (1U)
#define USB_DST_WD_HOV_MSK     (((1U << USB_DST_WD_HOV_LEN) - 1) << USB_DST_WD_HOV_POS)
#define USB_DST_WD_HOV_UMSK    (~(((1U << USB_DST_WD_HOV_LEN) - 1) << USB_DST_WD_HOV_POS))

