RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/usb_reg.h
/* 0x1C8 : DMA_CPS1 */
#define USB_DMA_CPS1_OFFSET           (0x1C8)
#define USB_DMA_START_HOV             USB_DMA_START_HOV
#define USB_DMA_START_HOV_POS         (0U)
#define USB_DMA_START_HOV_LEN         (1U)
#define USB_DMA_START_HOV_MSK         (((1U << USB_DMA_START_HOV_LEN) - 1) << USB_DMA_START_HOV_POS)
#define USB_DMA_START_HOV_UMSK        (~(((1U << USB_DMA_START_HOV_LEN) - 1) << USB_DMA_START_HOV_POS))
#define USB_DMA_TYPE_HOV              USB_DMA_TYPE_HOV
#define USB_DMA_TYPE_HOV_POS          (1U)
#define USB_DMA_TYPE_HOV_LEN          (1U)
#define USB_DMA_TYPE_HOV_MSK          (((1U << USB_DMA_TYPE_HOV_LEN) - 1) << USB_DMA_TYPE_HOV_POS)
#define USB_DMA_TYPE_HOV_UMSK         (~(((1U << USB_DMA_TYPE_HOV_LEN) - 1) << USB_DMA_TYPE_HOV_POS))
#define USB_DMA_IO_HOV                USB_DMA_IO_HOV
#define USB_DMA_IO_HOV_POS            (2U)
#define USB_DMA_IO_HOV_LEN            (1U)
#define USB_DMA_IO_HOV_MSK            (((1U << USB_DMA_IO_HOV_LEN) - 1) << USB_DMA_IO_HOV_POS)
#define USB_DMA_IO_HOV_UMSK           (~(((1U << USB_DMA_IO_HOV_LEN) - 1) << USB_DMA_IO_HOV_POS))
#define USB_DMA_ABORT_HOV             USB_DMA_ABORT_HOV
#define USB_DMA_ABORT_HOV_POS         (3U)
#define USB_DMA_ABORT_HOV_LEN         (1U)
#define USB_DMA_ABORT_HOV_MSK         (((1U << USB_DMA_ABORT_HOV_LEN) - 1) << USB_DMA_ABORT_HOV_POS)
#define USB_DMA_ABORT_HOV_UMSK        (~(((1U << USB_DMA_ABORT_HOV_LEN) - 1) << USB_DMA_ABORT_HOV_POS))
#define USB_CLRFIFO_DMAABORT_HOV      USB_CLRFIFO_DMAABORT_HOV
#define USB_CLRFIFO_DMAABORT_HOV_POS  (4U)
#define USB_CLRFIFO_DMAABORT_HOV_LEN  (1U)
#define USB_CLRFIFO_DMAABORT_HOV_MSK  (((1U << USB_CLRFIFO_DMAABORT_HOV_LEN) - 1) << USB_CLRFIFO_DMAABORT_HOV_POS)
#define USB_CLRFIFO_DMAABORT_HOV_UMSK (~(((1U << USB_CLRFIFO_DMAABORT_HOV_LEN) - 1) << USB_CLRFIFO_DMAABORT_HOV_POS))
#define USB_DMA_LEN_HOV               USB_DMA_LEN_HOV
#define USB_DMA_LEN_HOV_POS           (8U)
#define USB_DMA_LEN_HOV_LEN           (17U)
#define USB_DMA_LEN_HOV_MSK           (((1U << USB_DMA_LEN_HOV_LEN) - 1) << USB_DMA_LEN_HOV_POS)
#define USB_DMA_LEN_HOV_UMSK          (~(((1U << USB_DMA_LEN_HOV_LEN) - 1) << USB_DMA_LEN_HOV_POS))
#define USB_R_HPORT_HOV               USB_R_HPORT_HOV
#define USB_R_HPORT_HOV_POS           (25U)
#define USB_R_HPORT_HOV_LEN           (4U)
#define USB_R_HPORT_HOV_MSK           (((1U << USB_R_HPORT_HOV_LEN) - 1) << USB_R_HPORT_HOV_POS)
#define USB_R_HPORT_HOV_UMSK          (~(((1U << USB_R_HPORT_HOV_LEN) - 1) << USB_R_HPORT_HOV_POS))
#define USB_UNDEF_LEN_BURST_HOV       USB_UNDEF_LEN_BURST_HOV
#define USB_UNDEF_LEN_BURST_HOV_POS   (29U)
#define USB_UNDEF_LEN_BURST_HOV_LEN   (1U)
#define USB_UNDEF_LEN_BURST_HOV_MSK   (((1U << USB_UNDEF_LEN_BURST_HOV_LEN) - 1) << USB_UNDEF_LEN_BURST_HOV_POS)
#define USB_UNDEF_LEN_BURST_HOV_UMSK  (~(((1U << USB_UNDEF_LEN_BURST_HOV_LEN) - 1) << USB_UNDEF_LEN_BURST_HOV_POS))
#define USB_L1_WAKEUP                 USB_L1_WAKEUP
#define USB_L1_WAKEUP_POS             (30U)
#define USB_L1_WAKEUP_LEN             (1U)
#define USB_L1_WAKEUP_MSK             (((1U << USB_L1_WAKEUP_LEN) - 1) << USB_L1_WAKEUP_POS)
#define USB_L1_WAKEUP_UMSK            (~(((1U << USB_L1_WAKEUP_LEN) - 1) << USB_L1_WAKEUP_POS))
#define USB_DEVPHY_SUSPEND_HOV        USB_DEVPHY_SUSPEND_HOV
#define USB_DEVPHY_SUSPEND_HOV_POS    (31U)
#define USB_DEVPHY_SUSPEND_HOV_LEN    (1U)
#define USB_DEVPHY_SUSPEND_HOV_MSK    (((1U << USB_DEVPHY_SUSPEND_HOV_LEN) - 1) << USB_DEVPHY_SUSPEND_HOV_POS)
#define USB_DEVPHY_SUSPEND_HOV_UMSK   (~(((1U << USB_DEVPHY_SUSPEND_HOV_LEN) - 1) << USB_DEVPHY_SUSPEND_HOV_POS))

/* 0x1CC : DMA_CPS2 */
#define USB_DMA_CPS2_OFFSET    (0x1CC)
#define USB_DMA_MADDR_HOV      USB_DMA_MADDR_HOV
#define USB_DMA_MADDR_HOV_POS  (0U)
#define USB_DMA_MADDR_HOV_LEN  (32U)
#define USB_DMA_MADDR_HOV_MSK  (((1U << USB_DMA_MADDR_HOV_LEN) - 1) << USB_DMA_MADDR_HOV_POS)
#define USB_DMA_MADDR_HOV_UMSK (~(((1U << USB_DMA_MADDR_HOV_LEN) - 1) << USB_DMA_MADDR_HOV_POS))

/* 0x1D0 : DMA_CPS3 */
#define USB_DMA_CPS3_OFFSET      (0x1D0)
#define USB_SETUP_CMD_RPORT      USB_SETUP_CMD_RPORT
#define USB_SETUP_CMD_RPORT_POS  (0U)
#define USB_SETUP_CMD_RPORT_LEN  (32U)
#define USB_SETUP_CMD_RPORT_MSK  (((1U << USB_SETUP_CMD_RPORT_LEN) - 1) << USB_SETUP_CMD_RPORT_POS)
#define USB_SETUP_CMD_RPORT_UMSK (~(((1U << USB_SETUP_CMD_RPORT_LEN) - 1) << USB_SETUP_CMD_RPORT_POS))

/* 0x1D4 : DMA_CPS4 */
#define USB_DMA_CPS4_OFFSET (0x1D4)

/* 0x1D8 : DEV_FMAP2 */
#define USB_DEV_FMAP2_OFFSET (0x1D8)
#define USB_EPNO_FIFO4       USB_EPNO_FIFO4
#define USB_EPNO_FIFO4_POS   (0U)
#define USB_EPNO_FIFO4_LEN   (4U)
#define USB_EPNO_FIFO4_MSK   (((1U << USB_EPNO_FIFO4_LEN) - 1) << USB_EPNO_FIFO4_POS)
#define USB_EPNO_FIFO4_UMSK  (~(((1U << USB_EPNO_FIFO4_LEN) - 1) << USB_EPNO_FIFO4_POS))
#define USB_DIR_FIFO4        USB_DIR_FIFO4
#define USB_DIR_FIFO4_POS    (4U)
#define USB_DIR_FIFO4_LEN    (2U)
#define USB_DIR_FIFO4_MSK    (((1U << USB_DIR_FIFO4_LEN) - 1) << USB_DIR_FIFO4_POS)
#define USB_DIR_FIFO4_UMSK   (~(((1U << USB_DIR_FIFO4_LEN) - 1) << USB_DIR_FIFO4_POS))
#define USB_EPNO_FIFO5       USB_EPNO_FIFO5
#define USB_EPNO_FIFO5_POS   (8U)
#define USB_EPNO_FIFO5_LEN   (4U)
#define USB_EPNO_FIFO5_MSK   (((1U << USB_EPNO_FIFO5_LEN) - 1) << USB_EPNO_FIFO5_POS)
#define USB_EPNO_FIFO5_UMSK  (~(((1U << USB_EPNO_FIFO5_LEN) - 1) << USB_EPNO_FIFO5_POS))
#define USB_DIR_FIFO5        USB_DIR_FIFO5
#define USB_DIR_FIFO5_POS    (12U)
#define USB_DIR_FIFO5_LEN    (2U)
#define USB_DIR_FIFO5_MSK    (((1U << USB_DIR_FIFO5_LEN) - 1) << USB_DIR_FIFO5_POS)
#define USB_DIR_FIFO5_UMSK   (~(((1U << USB_DIR_FIFO5_LEN) - 1) << USB_DIR_FIFO5_POS))
#define USB_EPNO_FIFO6       USB_EPNO_FIFO6
#define USB_EPNO_FIFO6_POS   (16U)
#define USB_EPNO_FIFO6_LEN   (4U)
#define USB_EPNO_FIFO6_MSK   (((1U << USB_EPNO_FIFO6_LEN) - 1) << USB_EPNO_FIFO6_POS)
#define USB_EPNO_FIFO6_UMSK  (~(((1U << USB_EPNO_FIFO6_LEN) - 1) << USB_EPNO_FIFO6_POS))
#define USB_DIR_FIFO6        USB_DIR_FIFO6
#define USB_DIR_FIFO6_POS    (20U)
#define USB_DIR_FIFO6_LEN    (2U)
#define USB_DIR_FIFO6_MSK    (((1U << USB_DIR_FIFO6_LEN) - 1) << USB_DIR_FIFO6_POS)
#define USB_DIR_FIFO6_UMSK   (~(((1U << USB_DIR_FIFO6_LEN) - 1) << USB_DIR_FIFO6_POS))
#define USB_EPNO_FIFO7       USB_EPNO_FIFO7
#define USB_EPNO_FIFO7_POS   (24U)
#define USB_EPNO_FIFO7_LEN   (4U)
#define USB_EPNO_FIFO7_MSK   (((1U << USB_EPNO_FIFO7_LEN) - 1) << USB_EPNO_FIFO7_POS)
#define USB_EPNO_FIFO7_UMSK  (~(((1U << USB_EPNO_FIFO7_LEN) - 1) << USB_EPNO_FIFO7_POS))
#define USB_DIR_FIFO7        USB_DIR_FIFO7
#define USB_DIR_FIFO7_POS    (28U)
#define USB_DIR_FIFO7_LEN    (2U)
#define USB_DIR_FIFO7_MSK    (((1U << USB_DIR_FIFO7_LEN) - 1) << USB_DIR_FIFO7_POS)
#define USB_DIR_FIFO7_UMSK   (~(((1U << USB_DIR_FIFO7_LEN) - 1) << USB_DIR_FIFO7_POS))

/* 0x1DC : DEV_FCFG2 */
#define USB_DEV_FCFG2_OFFSET (0x1DC)
#define USB_BLK_TYP_F4       USB_BLK_TYP_F4
#define USB_BLK_TYP_F4_POS   (0U)
#define USB_BLK_TYP_F4_LEN   (2U)
#define USB_BLK_TYP_F4_MSK   (((1U << USB_BLK_TYP_F4_LEN) - 1) << USB_BLK_TYP_F4_POS)
#define USB_BLK_TYP_F4_UMSK  (~(((1U << USB_BLK_TYP_F4_LEN) - 1) << USB_BLK_TYP_F4_POS))
#define USB_BLKNO_F4         USB_BLKNO_F4
#define USB_BLKNO_F4_POS     (2U)
#define USB_BLKNO_F4_LEN     (2U)
#define USB_BLKNO_F4_MSK     (((1U << USB_BLKNO_F4_LEN) - 1) << USB_BLKNO_F4_POS)
#define USB_BLKNO_F4_UMSK    (~(((1U << USB_BLKNO_F4_LEN) - 1) << USB_BLKNO_F4_POS))
#define USB_BLKSZ_F4         USB_BLKSZ_F4
#define USB_BLKSZ_F4_POS     (4U)
#define USB_BLKSZ_F4_LEN     (1U)
#define USB_BLKSZ_F4_MSK     (((1U << USB_BLKSZ_F4_LEN) - 1) << USB_BLKSZ_F4_POS)
#define USB_BLKSZ_F4_UMSK    (~(((1U << USB_BLKSZ_F4_LEN) - 1) << USB_BLKSZ_F4_POS))
#define USB_EN_F4            USB_EN_F4
#define USB_EN_F4_POS        (5U)
#define USB_EN_F4_LEN        (1U)
#define USB_EN_F4_MSK        (((1U << USB_EN_F4_LEN) - 1) << USB_EN_F4_POS)
#define USB_EN_F4_UMSK       (~(((1U << USB_EN_F4_LEN) - 1) << USB_EN_F4_POS))
#define USB_BLK_TYP_F5       USB_BLK_TYP_F5
#define USB_BLK_TYP_F5_POS   (8U)
#define USB_BLK_TYP_F5_LEN   (2U)
#define USB_BLK_TYP_F5_MSK   (((1U << USB_BLK_TYP_F5_LEN) - 1) << USB_BLK_TYP_F5_POS)
#define USB_BLK_TYP_F5_UMSK  (~(((1U << USB_BLK_TYP_F5_LEN) - 1) << USB_BLK_TYP_F5_POS))
#define USB_BLKNO_F5         USB_BLKNO_F5
#define USB_BLKNO_F5_POS     (10U)
#define USB_BLKNO_F5_LEN     (2U)
#define USB_BLKNO_F5_MSK     (((1U << USB_BLKNO_F5_LEN) - 1) << USB_BLKNO_F5_POS)
#define USB_BLKNO_F5_UMSK    (~(((1U << USB_BLKNO_F5_LEN) - 1) << USB_BLKNO_F5_POS))
#define USB_BLKSZ_F5         USB_BLKSZ_F5
#define USB_BLKSZ_F5_POS     (12U)
#define USB_BLKSZ_F5_LEN     (1U)
#define USB_BLKSZ_F5_MSK     (((1U << USB_BLKSZ_F5_LEN) - 1) << USB_BLKSZ_F5_POS)
#define USB_BLKSZ_F5_UMSK    (~(((1U << USB_BLKSZ_F5_LEN) - 1) << USB_BLKSZ_F5_POS))
#define USB_EN_F5            USB_EN_F5
#define USB_EN_F5_POS        (13U)
#define USB_EN_F5_LEN        (1U)
#define USB_EN_F5_MSK        (((1U << USB_EN_F5_LEN) - 1) << USB_EN_F5_POS)
#define USB_EN_F5_UMSK       (~(((1U << USB_EN_F5_LEN) - 1) << USB_EN_F5_POS))
#define USB_BLK_TYP_F6       USB_BLK_TYP_F6
#define USB_BLK_TYP_F6_POS   (16U)
#define USB_BLK_TYP_F6_LEN   (2U)
#define USB_BLK_TYP_F6_MSK   (((1U << USB_BLK_TYP_F6_LEN) - 1) << USB_BLK_TYP_F6_POS)
#define USB_BLK_TYP_F6_UMSK  (~(((1U << USB_BLK_TYP_F6_LEN) - 1) << USB_BLK_TYP_F6_POS))
#define USB_BLKNO_F6         USB_BLKNO_F6
#define USB_BLKNO_F6_POS     (18U)
#define USB_BLKNO_F6_LEN     (2U)
#define USB_BLKNO_F6_MSK     (((1U << USB_BLKNO_F6_LEN) - 1) << USB_BLKNO_F6_POS)
#define USB_BLKNO_F6_UMSK    (~(((1U << USB_BLKNO_F6_LEN) - 1) << USB_BLKNO_F6_POS))
#define USB_BLKSZ_F6         USB_BLKSZ_F6
#define USB_BLKSZ_F6_POS     (20U)
#define USB_BLKSZ_F6_LEN     (1U)
#define USB_BLKSZ_F6_MSK     (((1U << USB_BLKSZ_F6_LEN) - 1) << USB_BLKSZ_F6_POS)
#define USB_BLKSZ_F6_UMSK    (~(((1U << USB_BLKSZ_F6_LEN) - 1) << USB_BLKSZ_F6_POS))
#define USB_EN_F6            USB_EN_F6
#define USB_EN_F6_POS        (21U)
#define USB_EN_F6_LEN        (1U)
#define USB_EN_F6_MSK        (((1U << USB_EN_F6_LEN) - 1) << USB_EN_F6_POS)
#define USB_EN_F6_UMSK       (~(((1U << USB_EN_F6_LEN) - 1) << USB_EN_F6_POS))
#define USB_BLK_TYP_F7       USB_BLK_TYP_F7
#define USB_BLK_TYP_F7_POS   (24U)
#define USB_BLK_TYP_F7_LEN   (2U)
#define USB_BLK_TYP_F7_MSK   (((1U << USB_BLK_TYP_F7_LEN) - 1) << USB_BLK_TYP_F7_POS)
#define USB_BLK_TYP_F7_UMSK  (~(((1U << USB_BLK_TYP_F7_LEN) - 1) << USB_BLK_TYP_F7_POS))
#define USB_BLKNO_F7         USB_BLKNO_F7
#define USB_BLKNO_F7_POS     (26U)
#define USB_BLKNO_F7_LEN     (2U)
#define USB_BLKNO_F7_MSK     (((1U << USB_BLKNO_F7_LEN) - 1) << USB_BLKNO_F7_POS)
#define USB_BLKNO_F7_UMSK    (~(((1U << USB_BLKNO_F7_LEN) - 1) << USB_BLKNO_F7_POS))
#define USB_BLKSZ_F7         USB_BLKSZ_F7
#define USB_BLKSZ_F7_POS     (28U)
#define USB_BLKSZ_F7_LEN     (1U)
#define USB_BLKSZ_F7_MSK     (((1U << USB_BLKSZ_F7_LEN) - 1) << USB_BLKSZ_F7_POS)
#define USB_BLKSZ_F7_UMSK    (~(((1U << USB_BLKSZ_F7_LEN) - 1) << USB_BLKSZ_F7_POS))
#define USB_EN_F7            USB_EN_F7
#define USB_EN_F7_POS        (29U)
#define USB_EN_F7_LEN        (1U)
#define USB_EN_F7_MSK        (((1U << USB_EN_F7_LEN) - 1) << USB_EN_F7_POS)
#define USB_EN_F7_UMSK       (~(((1U << USB_EN_F7_LEN) - 1) << USB_EN_F7_POS))

/* 0x1E0 : DEV_FMAP3 */
#define USB_DEV_FMAP3_OFFSET (0x1E0)
#define USB_EPNO_FIFO8       USB_EPNO_FIFO8
#define USB_EPNO_FIFO8_POS   (0U)
#define USB_EPNO_FIFO8_LEN   (4U)
#define USB_EPNO_FIFO8_MSK   (((1U << USB_EPNO_FIFO8_LEN) - 1) << USB_EPNO_FIFO8_POS)
#define USB_EPNO_FIFO8_UMSK  (~(((1U << USB_EPNO_FIFO8_LEN) - 1) << USB_EPNO_FIFO8_POS))
#define USB_DIR_FIFO8        USB_DIR_FIFO8
#define USB_DIR_FIFO8_POS    (4U)
#define USB_DIR_FIFO8_LEN    (2U)
#define USB_DIR_FIFO8_MSK    (((1U << USB_DIR_FIFO8_LEN) - 1) << USB_DIR_FIFO8_POS)
#define USB_DIR_FIFO8_UMSK   (~(((1U << USB_DIR_FIFO8_LEN) - 1) << USB_DIR_FIFO8_POS))
#define USB_EPNO_FIFO9       USB_EPNO_FIFO9
#define USB_EPNO_FIFO9_POS   (8U)
#define USB_EPNO_FIFO9_LEN   (4U)
#define USB_EPNO_FIFO9_MSK   (((1U << USB_EPNO_FIFO9_LEN) - 1) << USB_EPNO_FIFO9_POS)
#define USB_EPNO_FIFO9_UMSK  (~(((1U << USB_EPNO_FIFO9_LEN) - 1) << USB_EPNO_FIFO9_POS))
#define USB_DIR_FIFO9        USB_DIR_FIFO9
#define USB_DIR_FIFO9_POS    (12U)
#define USB_DIR_FIFO9_LEN    (2U)
#define USB_DIR_FIFO9_MSK    (((1U << USB_DIR_FIFO9_LEN) - 1) << USB_DIR_FIFO9_POS)
#define USB_DIR_FIFO9_UMSK   (~(((1U << USB_DIR_FIFO9_LEN) - 1) << USB_DIR_FIFO9_POS))
#define USB_EPNO_FIFO10      USB_EPNO_FIFO10
#define USB_EPNO_FIFO10_POS  (16U)
#define USB_EPNO_FIFO10_LEN  (4U)
#define USB_EPNO_FIFO10_MSK  (((1U << USB_EPNO_FIFO10_LEN) - 1) << USB_EPNO_FIFO10_POS)
#define USB_EPNO_FIFO10_UMSK (~(((1U << USB_EPNO_FIFO10_LEN) - 1) << USB_EPNO_FIFO10_POS))
#define USB_DIR_FIFO10       USB_DIR_FIFO10
#define USB_DIR_FIFO10_POS   (20U)
#define USB_DIR_FIFO10_LEN   (2U)
#define USB_DIR_FIFO10_MSK   (((1U << USB_DIR_FIFO10_LEN) - 1) << USB_DIR_FIFO10_POS)
#define USB_DIR_FIFO10_UMSK  (~(((1U << USB_DIR_FIFO10_LEN) - 1) << USB_DIR_FIFO10_POS))
#define USB_EPNO_FIFO11      USB_EPNO_FIFO11
#define USB_EPNO_FIFO11_POS  (24U)
#define USB_EPNO_FIFO11_LEN  (4U)
#define USB_EPNO_FIFO11_MSK  (((1U << USB_EPNO_FIFO11_LEN) - 1) << USB_EPNO_FIFO11_POS)
#define USB_EPNO_FIFO11_UMSK (~(((1U << USB_EPNO_FIFO11_LEN) - 1) << USB_EPNO_FIFO11_POS))
#define USB_DIR_FIFO11       USB_DIR_FIFO11
#define USB_DIR_FIFO11_POS   (28U)
#define USB_DIR_FIFO11_LEN   (2U)
#define USB_DIR_FIFO11_MSK   (((1U << USB_DIR_FIFO11_LEN) - 1) << USB_DIR_FIFO11_POS)
#define USB_DIR_FIFO11_UMSK  (~(((1U << USB_DIR_FIFO11_LEN) - 1) << USB_DIR_FIFO11_POS))

/* 0x1E4 : DEV_FCFG3 */
#define USB_DEV_FCFG3_OFFSET (0x1E4)
#define USB_BLK_TYP_F8       USB_BLK_TYP_F8
#define USB_BLK_TYP_F8_POS   (0U)
#define USB_BLK_TYP_F8_LEN   (2U)
#define USB_BLK_TYP_F8_MSK   (((1U << USB_BLK_TYP_F8_LEN) - 1) << USB_BLK_TYP_F8_POS)
#define USB_BLK_TYP_F8_UMSK  (~(((1U << USB_BLK_TYP_F8_LEN) - 1) << USB_BLK_TYP_F8_POS))
#define USB_BLKNO_F8         USB_BLKNO_F8
#define USB_BLKNO_F8_POS     (2U)
#define USB_BLKNO_F8_LEN     (2U)
#define USB_BLKNO_F8_MSK     (((1U << USB_BLKNO_F8_LEN) - 1) << USB_BLKNO_F8_POS)
#define USB_BLKNO_F8_UMSK    (~(((1U << USB_BLKNO_F8_LEN) - 1) << USB_BLKNO_F8_POS))
#define USB_BLKSZ_F8         USB_BLKSZ_F8
#define USB_BLKSZ_F8_POS     (4U)
#define USB_BLKSZ_F8_LEN     (1U)
#define USB_BLKSZ_F8_MSK     (((1U << USB_BLKSZ_F8_LEN) - 1) << USB_BLKSZ_F8_POS)
#define USB_BLKSZ_F8_UMSK    (~(((1U << USB_BLKSZ_F8_LEN) - 1) << USB_BLKSZ_F8_POS))
#define USB_EN_F8            USB_EN_F8
#define USB_EN_F8_POS        (5U)
#define USB_EN_F8_LEN        (1U)
#define USB_EN_F8_MSK        (((1U << USB_EN_F8_LEN) - 1) << USB_EN_F8_POS)
#define USB_EN_F8_UMSK       (~(((1U << USB_EN_F8_LEN) - 1) << USB_EN_F8_POS))
#define USB_BLK_TYP_F9       USB_BLK_TYP_F9
#define USB_BLK_TYP_F9_POS   (8U)
#define USB_BLK_TYP_F9_LEN   (2U)
#define USB_BLK_TYP_F9_MSK   (((1U << USB_BLK_TYP_F9_LEN) - 1) << USB_BLK_TYP_F9_POS)
#define USB_BLK_TYP_F9_UMSK  (~(((1U << USB_BLK_TYP_F9_LEN) - 1) << USB_BLK_TYP_F9_POS))
#define USB_BLKNO_F9         USB_BLKNO_F9
#define USB_BLKNO_F9_POS     (10U)
#define USB_BLKNO_F9_LEN     (2U)
#define USB_BLKNO_F9_MSK     (((1U << USB_BLKNO_F9_LEN) - 1) << USB_BLKNO_F9_POS)
#define USB_BLKNO_F9_UMSK    (~(((1U << USB_BLKNO_F9_LEN) - 1) << USB_BLKNO_F9_POS))
#define USB_BLKSZ_F9         USB_BLKSZ_F9
#define USB_BLKSZ_F9_POS     (12U)
#define USB_BLKSZ_F9_LEN     (1U)
#define USB_BLKSZ_F9_MSK     (((1U << USB_BLKSZ_F9_LEN) - 1) << USB_BLKSZ_F9_POS)
#define USB_BLKSZ_F9_UMSK    (~(((1U << USB_BLKSZ_F9_LEN) - 1) << USB_BLKSZ_F9_POS))
#define USB_EN_F9            USB_EN_F9
#define USB_EN_F9_POS        (13U)
#define USB_EN_F9_LEN        (1U)
#define USB_EN_F9_MSK        (((1U << USB_EN_F9_LEN) - 1) << USB_EN_F9_POS)
#define USB_EN_F9_UMSK       (~(((1U << USB_EN_F9_LEN) - 1) << USB_EN_F9_POS))
#define USB_BLK_TYP_F10      USB_BLK_TYP_F10
#define USB_BLK_TYP_F10_POS  (16U)
#define USB_BLK_TYP_F10_LEN  (2U)
#define USB_BLK_TYP_F10_MSK  (((1U << USB_BLK_TYP_F10_LEN) - 1) << USB_BLK_TYP_F10_POS)
#define USB_BLK_TYP_F10_UMSK (~(((1U << USB_BLK_TYP_F10_LEN) - 1) << USB_BLK_TYP_F10_POS))
#define USB_BLKNO_F10        USB_BLKNO_F10
#define USB_BLKNO_F10_POS    (18U)
#define USB_BLKNO_F10_LEN    (2U)
#define USB_BLKNO_F10_MSK    (((1U << USB_BLKNO_F10_LEN) - 1) << USB_BLKNO_F10_POS)
#define USB_BLKNO_F10_UMSK   (~(((1U << USB_BLKNO_F10_LEN) - 1) << USB_BLKNO_F10_POS))
#define USB_BLKSZ_F10        USB_BLKSZ_F10
#define USB_BLKSZ_F10_POS    (20U)
#define USB_BLKSZ_F10_LEN    (1U)
#define USB_BLKSZ_F10_MSK    (((1U << USB_BLKSZ_F10_LEN) - 1) << USB_BLKSZ_F10_POS)
#define USB_BLKSZ_F10_UMSK   (~(((1U << USB_BLKSZ_F10_LEN) - 1) << USB_BLKSZ_F10_POS))
#define USB_EN_F10           USB_EN_F10
#define USB_EN_F10_POS       (21U)
#define USB_EN_F10_LEN       (1U)
#define USB_EN_F10_MSK       (((1U << USB_EN_F10_LEN) - 1) << USB_EN_F10_POS)
#define USB_EN_F10_UMSK      (~(((1U << USB_EN_F10_LEN) - 1) << USB_EN_F10_POS))
#define USB_BLK_TYP_F11      USB_BLK_TYP_F11
#define USB_BLK_TYP_F11_POS  (24U)
#define USB_BLK_TYP_F11_LEN  (2U)
#define USB_BLK_TYP_F11_MSK  (((1U << USB_BLK_TYP_F11_LEN) - 1) << USB_BLK_TYP_F11_POS)
#define USB_BLK_TYP_F11_UMSK (~(((1U << USB_BLK_TYP_F11_LEN) - 1) << USB_BLK_TYP_F11_POS))
#define USB_BLKNO_F11        USB_BLKNO_F11
#define USB_BLKNO_F11_POS    (26U)
#define USB_BLKNO_F11_LEN    (2U)
#define USB_BLKNO_F11_MSK    (((1U << USB_BLKNO_F11_LEN) - 1) << USB_BLKNO_F11_POS)
#define USB_BLKNO_F11_UMSK   (~(((1U << USB_BLKNO_F11_LEN) - 1) << USB_BLKNO_F11_POS))
#define USB_BLKSZ_F11        USB_BLKSZ_F11
#define USB_BLKSZ_F11_POS    (28U)
#define USB_BLKSZ_F11_LEN    (1U)
#define USB_BLKSZ_F11_MSK    (((1U << USB_BLKSZ_F11_LEN) - 1) << USB_BLKSZ_F11_POS)
#define USB_BLKSZ_F11_UMSK   (~(((1U << USB_BLKSZ_F11_LEN) - 1) << USB_BLKSZ_F11_POS))
#define USB_EN_F11           USB_EN_F11
#define USB_EN_F11_POS       (29U)
#define USB_EN_F11_LEN       (1U)
#define USB_EN_F11_MSK       (((1U << USB_EN_F11_LEN) - 1) << USB_EN_F11_POS)
#define USB_EN_F11_UMSK      (~(((1U << USB_EN_F11_LEN) - 1) << USB_EN_F11_POS))

/* 0x1E8 : DEV_FMAP4 */
#define USB_DEV_FMAP4_OFFSET (0x1E8)
#define USB_EPNO_FIFO12      USB_EPNO_FIFO12
#define USB_EPNO_FIFO12_POS  (0U)
#define USB_EPNO_FIFO12_LEN  (4U)
#define USB_EPNO_FIFO12_MSK  (((1U << USB_EPNO_FIFO12_LEN) - 1) << USB_EPNO_FIFO12_POS)
#define USB_EPNO_FIFO12_UMSK (~(((1U << USB_EPNO_FIFO12_LEN) - 1) << USB_EPNO_FIFO12_POS))
#define USB_DIR_FIFO12       USB_DIR_FIFO12
#define USB_DIR_FIFO12_POS   (4U)
#define USB_DIR_FIFO12_LEN   (2U)
#define USB_DIR_FIFO12_MSK   (((1U << USB_DIR_FIFO12_LEN) - 1) << USB_DIR_FIFO12_POS)
#define USB_DIR_FIFO12_UMSK  (~(((1U << USB_DIR_FIFO12_LEN) - 1) << USB_DIR_FIFO12_POS))
#define USB_EPNO_FIFO13      USB_EPNO_FIFO13
#define USB_EPNO_FIFO13_POS  (8U)
#define USB_EPNO_FIFO13_LEN  (4U)
#define USB_EPNO_FIFO13_MSK  (((1U << USB_EPNO_FIFO13_LEN) - 1) << USB_EPNO_FIFO13_POS)
#define USB_EPNO_FIFO13_UMSK (~(((1U << USB_EPNO_FIFO13_LEN) - 1) << USB_EPNO_FIFO13_POS))
#define USB_DIR_FIFO13       USB_DIR_FIFO13
#define USB_DIR_FIFO13_POS   (12U)
#define USB_DIR_FIFO13_LEN   (2U)
#define USB_DIR_FIFO13_MSK   (((1U << USB_DIR_FIFO13_LEN) - 1) << USB_DIR_FIFO13_POS)
#define USB_DIR_FIFO13_UMSK  (~(((1U << USB_DIR_FIFO13_LEN) - 1) << USB_DIR_FIFO13_POS))
#define USB_EPNO_FIFO14      USB_EPNO_FIFO14
#define USB_EPNO_FIFO14_POS  (16U)
#define USB_EPNO_FIFO14_LEN  (4U)
#define USB_EPNO_FIFO14_MSK  (((1U << USB_EPNO_FIFO14_LEN) - 1) << USB_EPNO_FIFO14_POS)
#define USB_EPNO_FIFO14_UMSK (~(((1U << USB_EPNO_FIFO14_LEN) - 1) << USB_EPNO_FIFO14_POS))
#define USB_DIR_FIFO14       USB_DIR_FIFO14
#define USB_DIR_FIFO14_POS   (20U)
#define USB_DIR_FIFO14_LEN   (2U)
#define USB_DIR_FIFO14_MSK   (((1U << USB_DIR_FIFO14_LEN) - 1) << USB_DIR_FIFO14_POS)
#define USB_DIR_FIFO14_UMSK  (~(((1U << USB_DIR_FIFO14_LEN) - 1) << USB_DIR_FIFO14_POS))
#define USB_EPNO_FIFO15      USB_EPNO_FIFO15
#define USB_EPNO_FIFO15_POS  (24U)
#define USB_EPNO_FIFO15_LEN  (4U)
#define USB_EPNO_FIFO15_MSK  (((1U << USB_EPNO_FIFO15_LEN) - 1) << USB_EPNO_FIFO15_POS)
#define USB_EPNO_FIFO15_UMSK (~(((1U << USB_EPNO_FIFO15_LEN) - 1) << USB_EPNO_FIFO15_POS))
#define USB_DIR_FIFO15       USB_DIR_FIFO15
#define USB_DIR_FIFO15_POS   (28U)
#define USB_DIR_FIFO15_LEN   (2U)
#define USB_DIR_FIFO15_MSK   (((1U << USB_DIR_FIFO15_LEN) - 1) << USB_DIR_FIFO15_POS)
#define USB_DIR_FIFO15_UMSK  (~(((1U << USB_DIR_FIFO15_LEN) - 1) << USB_DIR_FIFO15_POS))

