RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/usb_reg.h
    /* 0x018 : USBINTR */
    union {
        struct
        {
            uint32_t USB_INT_EN    : 1;  /* [    0],       None,        0x0 */
            uint32_t USBERR_INT_EN : 1;  /* [    1],       None,        0x0 */
            uint32_t PO_CHG_INT_EN : 1;  /* [    2],       None,        0x0 */
            uint32_t FRL_ROL_EN    : 1;  /* [    3],       None,        0x0 */
            uint32_t H_SYSERR_EN   : 1;  /* [    4],       None,        0x0 */
            uint32_t INT_OAA_EN    : 1;  /* [    5],       None,        0x0 */
            uint32_t reserved_6_31 : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } USBINTR;

    /* 0x01C : FRINDEX */
    union {
        struct
        {
            uint32_t FRINDEX        : 14; /* [13: 0],       None,        0x0 */
            uint32_t reserved_14_31 : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } FRINDEX;

    /* 0x20  reserved */
    uint8_t RESERVED0x20[4];

    /* 0x024 : PERIODICLISTBASE */
    union {
        struct
        {
            uint32_t reserved_0_11 : 12; /* [11: 0],       rsvd,        0x0 */
            uint32_t PERI_BASADR   : 20; /* [31:12],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } PERIODICLISTBASE;

    /* 0x028 : ASYNCLISTADDR */
    union {
        struct
        {
            uint32_t reserved_0_4 : 5;  /* [ 4: 0],       rsvd,        0x0 */
            uint32_t Async_ladr   : 27; /* [31: 5],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } ASYNCLISTADDR;

    /* 0x2c  reserved */
    uint8_t RESERVED0x2c[4];

    /* 0x030 : PORTSC */
    union {
        struct
        {
            uint32_t CONN_STS       : 1;  /* [    0],       None,        0x0 */
            uint32_t CONN_CHG       : 1;  /* [    1],       None,        0x0 */
            uint32_t PO_EN          : 1;  /* [    2],       None,        0x0 */
            uint32_t PO_EN_CHG      : 1;  /* [    3],       None,        0x0 */
            uint32_t reserved_4_5   : 2;  /* [ 5: 4],       rsvd,        0x0 */
            uint32_t F_PO_RESM      : 1;  /* [    6],       None,        0x0 */
            uint32_t PO_SUSP        : 1;  /* [    7],       None,        0x0 */
            uint32_t PO_RESET       : 1;  /* [    8],       None,        0x0 */
            uint32_t reserved_9     : 1;  /* [    9],       rsvd,        0x0 */
            uint32_t LINE_STS       : 2;  /* [11:10],       None,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t PORT_TEST      : 4;  /* [19:16],       None,        0x0 */
            uint32_t HC_TST_PKDONE  : 1;  /* [   20],       None,        0x0 */
            uint32_t reserved_21_31 : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PORTSC;

    /* 0x34  reserved */
    uint8_t RESERVED0x34[12];

    /* 0x040 : HCMISC */
    union {
        struct
        {
            uint32_t ASYN_SCH_SLPT   : 2;  /* [ 1: 0],       None,        0x0 */
            uint32_t EOF1_Time       : 2;  /* [ 3: 2],       None,        0x0 */
            uint32_t EOF2_Time       : 2;  /* [ 5: 4],       None,        0x0 */
            uint32_t HostPhy_Suspend : 1;  /* [    6],       None,        0x0 */
            uint32_t reserved_7      : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t HC_WKP_DET_EN   : 1;  /* [    8],       None,        0x0 */
            uint32_t HC_CONN_DET_EN  : 1;  /* [    9],       None,        0x0 */
            uint32_t reserved_10_31  : 22; /* [31:10],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } HCMISC;

    /* 0x044 : FS_EOF */
    union {
        struct
        {
            uint32_t FS_EOF1_Time       : 12; /* [11: 0],       None,        0x0 */
            uint32_t FS_EOF1_Time_125us : 3;  /* [14:12],       None,        0x0 */
            uint32_t reserved_15        : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t iTDdmaSM           : 4;  /* [19:16],       None,        0x0 */
            uint32_t iTDTravSM          : 2;  /* [21:20],       None,        0x0 */
            uint32_t DMAdmSM            : 4;  /* [25:22],       None,        0x0 */
            uint32_t QHTtrSM            : 3;  /* [28:26],       None,        0x0 */
            uint32_t QHTravSM           : 3;  /* [31:29],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } FS_EOF;

    /* 0x048 : HS_EOF */
    union {
        struct
        {
            uint32_t HS_EOF1_Time   : 12; /* [11: 0],       None,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t siTDdmaSM      : 4;  /* [19:16],       None,        0x0 */
            uint32_t siTDTravSM     : 2;  /* [21:20],       None,        0x0 */
            uint32_t reserved_22_31 : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } HS_EOF;

    /* 0x4c  reserved */
    uint8_t RESERVED0x4c[52];

    /* 0x080 : OTG_CSR */
    union {
        struct
        {
            uint32_t B_BUS_REQ            : 1; /* [    0],       None,        0x0 */
            uint32_t B_HNP_EN             : 1; /* [    1],       None,        0x0 */
            uint32_t B_DSCHRG_VBUS        : 1; /* [    2],       None,        0x0 */
            uint32_t reserved_3           : 1; /* [    3],       rsvd,        0x0 */
            uint32_t A_BUS_REQ_HOV        : 1; /* [    4],       None,        0x0 */
            uint32_t A_BUS_DROP_HOV       : 1; /* [    5],       None,        0x0 */
            uint32_t A_SET_B_HNP_EN       : 1; /* [    6],       None,        0x0 */
            uint32_t A_SRP_DET_EN         : 1; /* [    7],       None,        0x0 */
            uint32_t A_SRP_RESP_TYP       : 1; /* [    8],       None,        0x0 */
            uint32_t ID_FLT_SEL           : 1; /* [    9],       None,        0x0 */
            uint32_t VBUS_FLT_SEL_HOV_POV : 1; /* [   10],       None,        0x0 */
            uint32_t HDISCON_FLT_SEL_HOV  : 1; /* [   11],       None,        0x0 */
            uint32_t reserved_12          : 1; /* [   12],       rsvd,        0x0 */
            uint32_t IDPULUP_HOV_POV      : 1; /* [   13],       None,        0x0 */
            uint32_t reserved_14_15       : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t B_SESS_END_POV       : 1; /* [   16],       None,        0x0 */
            uint32_t B_SESS_VLD_POV       : 1; /* [   17],       None,        0x0 */
            uint32_t A_SESS_VLD           : 1; /* [   18],       None,        0x0 */
            uint32_t VBUS_VLD_HOV         : 1; /* [   19],       None,        0x0 */
            uint32_t CROLE_HOV_POV        : 1; /* [   20],       None,        0x0 */
            uint32_t ID_HOV_POV           : 1; /* [   21],       None,        0x0 */
            uint32_t SPD_TYP_HOV_POV      : 2; /* [23:22],       None,        0x0 */
            uint32_t reserved_24_31       : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } OTG_CSR;

    /* 0x084 : OTG_ISR */
    union {
        struct
        {
            uint32_t B_SRP_DN       : 1;  /* [    0],       None,        0x0 */
            uint32_t reserved_1_3   : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t A_SRP_DET      : 1;  /* [    4],       None,        0x0 */
            uint32_t A_VBUS_ERR_HOV : 1;  /* [    5],       None,        0x0 */
            uint32_t B_SESS_END_POV : 1;  /* [    6],       None,        0x0 */
            uint32_t reserved_7     : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t RLCHG          : 1;  /* [    8],       None,        0x0 */
            uint32_t IDCHG          : 1;  /* [    9],       None,        0x0 */
            uint32_t OVC_HOV        : 1;  /* [   10],       None,        0x0 */
            uint32_t A_WAIT_CON_HOV : 1;  /* [   11],       None,        0x0 */
            uint32_t APLGRMV        : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } OTG_ISR;

    /* 0x088 : OTG_IER */
    union {
        struct
        {
            uint32_t B_SRP_DN_EN       : 1;  /* [    0],       None,        0x0 */
            uint32_t reserved_1_3      : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t A_SRP_DET_EN      : 1;  /* [    4],       None,        0x0 */
            uint32_t A_VBUS_ERR_EN_HOV : 1;  /* [    5],       None,        0x0 */
            uint32_t B_SESS_END_EN_POV : 1;  /* [    6],       None,        0x0 */
            uint32_t reserved_7        : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t RLCHG_EN          : 1;  /* [    8],       None,        0x0 */
            uint32_t IDCHG_EN          : 1;  /* [    9],       None,        0x0 */
            uint32_t OVC_EN_HOV        : 1;  /* [   10],       None,        0x0 */
            uint32_t A_WAIT_CON_EN_HOV : 1;  /* [   11],       None,        0x0 */
            uint32_t APLGRMV_EN        : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31    : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } OTG_IER;

