RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/usb_reg.h
    /* 0x134 : DEV_MISG0 */
    union {
        struct
        {
            uint32_t MCX_SETUP_INT    : 1;  /* [    0],       None,        0x0 */
            uint32_t MCX_IN_INT       : 1;  /* [    1],       None,        0x0 */
            uint32_t MCX_OUT_INT      : 1;  /* [    2],       None,        0x0 */
            uint32_t reserved_3       : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t MCX_COMFAIL_INT  : 1;  /* [    4],       None,        0x0 */
            uint32_t MCX_COMABORT_INT : 1;  /* [    5],       None,        0x0 */
            uint32_t reserved_6_31    : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_MISG0;

    /* 0x138 : DEV_MISG1 */
    union {
        struct
        {
            uint32_t MF0_OUT_INT : 1; /* [    0],       None,        0x0 */
            uint32_t MF0_SPK_INT : 1; /* [    1],       None,        0x0 */
            uint32_t MF1_OUT_INT : 1; /* [    2],       None,        0x0 */
            uint32_t MF1_SPK_INT : 1; /* [    3],       None,        0x0 */
            uint32_t MF2_OUT_INT : 1; /* [    4],       None,        0x0 */
            uint32_t MF2_SPK_INT : 1; /* [    5],       None,        0x0 */
            uint32_t MF3_OUT_INT : 1; /* [    6],       None,        0x0 */
            uint32_t MF3_SPK_INT : 1; /* [    7],       None,        0x0 */
            uint32_t MF4_OUT_INT : 1; /* [    8],       None,        0x0 */
            uint32_t MF4_SPK_INT : 1; /* [    9],       None,        0x0 */
            uint32_t MF5_OUT_INT : 1; /* [   10],       None,        0x0 */
            uint32_t MF5_SPK_INT : 1; /* [   11],       None,        0x0 */
            uint32_t MF6_OUT_INT : 1; /* [   12],       None,        0x0 */
            uint32_t MF6_SPK_INT : 1; /* [   13],       None,        0x0 */
            uint32_t MF7_OUT_INT : 1; /* [   14],       None,        0x0 */
            uint32_t MF7_SPK_INT : 1; /* [   15],       None,        0x0 */
            uint32_t MF0_IN_INT  : 1; /* [   16],       None,        0x0 */
            uint32_t MF1_IN_INT  : 1; /* [   17],       None,        0x0 */
            uint32_t MF2_IN_INT  : 1; /* [   18],       None,        0x0 */
            uint32_t MF3_IN_INT  : 1; /* [   19],       None,        0x0 */
            uint32_t MF4_IN_INT  : 1; /* [   20],       None,        0x0 */
            uint32_t MF5_IN_INT  : 1; /* [   21],       None,        0x0 */
            uint32_t MF6_IN_INT  : 1; /* [   22],       None,        0x0 */
            uint32_t MF7_IN_INT  : 1; /* [   23],       None,        0x0 */
            uint32_t MF8_IN_INT  : 1; /* [   24],       None,        0x0 */
            uint32_t MF9_IN_INT  : 1; /* [   25],       None,        0x0 */
            uint32_t MF10_IN_INT : 1; /* [   26],       None,        0x0 */
            uint32_t MF11_IN_INT : 1; /* [   27],       None,        0x0 */
            uint32_t MF12_IN_INT : 1; /* [   28],       None,        0x0 */
            uint32_t MF13_IN_INT : 1; /* [   29],       None,        0x0 */
            uint32_t MF14_IN_INT : 1; /* [   30],       None,        0x0 */
            uint32_t MF15_IN_INT : 1; /* [   31],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_MISG1;

    /* 0x13C : DEV_MISG2 */
    union {
        struct
        {
            uint32_t MUSBRST_INT        : 1; /* [    0],       None,        0x0 */
            uint32_t MSUSP_INT          : 1; /* [    1],       None,        0x0 */
            uint32_t MRESM_INT          : 1; /* [    2],       None,        0x0 */
            uint32_t MSEQ_ERR_INT       : 1; /* [    3],       None,        0x0 */
            uint32_t MSEQ_ABORT_INT     : 1; /* [    4],       None,        0x0 */
            uint32_t MTX0BYTE_INT       : 1; /* [    5],       None,        0x0 */
            uint32_t MRX0BYTE_INT       : 1; /* [    6],       None,        0x0 */
            uint32_t MDMA_CMPLT_HOV     : 1; /* [    7],       None,        0x0 */
            uint32_t MDMA_ERROR_HOV     : 1; /* [    8],       None,        0x0 */
            uint32_t MDev_Idle_HOV      : 1; /* [    9],       None,        0x0 */
            uint32_t MDev_Wakeup_byVBUS : 1; /* [   10],       None,        0x0 */
            uint32_t reserved_11_15     : 5; /* [15:11],       rsvd,        0x0 */
            uint32_t MF8_OUT_INT        : 1; /* [   16],       None,        0x0 */
            uint32_t MF8_SPK_INT        : 1; /* [   17],       None,        0x0 */
            uint32_t MF9_OUT_INT        : 1; /* [   18],       None,        0x0 */
            uint32_t MF9_SPK_INT        : 1; /* [   19],       None,        0x0 */
            uint32_t MF10_OUT_INT       : 1; /* [   20],       None,        0x0 */
            uint32_t MF10_SPK_INT       : 1; /* [   21],       None,        0x0 */
            uint32_t MF11_OUT_INT       : 1; /* [   22],       None,        0x0 */
            uint32_t MF11_SPK_INT       : 1; /* [   23],       None,        0x0 */
            uint32_t MF12_OUT_INT       : 1; /* [   24],       None,        0x0 */
            uint32_t MF12_SPK_INT       : 1; /* [   25],       None,        0x0 */
            uint32_t MF13_OUT_INT       : 1; /* [   26],       None,        0x0 */
            uint32_t MF13_SPK_INT       : 1; /* [   27],       None,        0x0 */
            uint32_t MF14_OUT_INT       : 1; /* [   28],       None,        0x0 */
            uint32_t MF14_SPK_INT       : 1; /* [   29],       None,        0x0 */
            uint32_t MF15_OUT_INT       : 1; /* [   30],       None,        0x0 */
            uint32_t MF15_SPK_INT       : 1; /* [   31],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_MISG2;

    /* 0x140 : DEV_IGR */
    union {
        struct
        {
            uint32_t INT_G0        : 1;  /* [    0],       None,        0x0 */
            uint32_t INT_G1        : 1;  /* [    1],       None,        0x0 */
            uint32_t INT_G2_HOV    : 1;  /* [    2],       None,        0x0 */
            uint32_t INT_G3        : 1;  /* [    3],       None,        0x0 */
            uint32_t INT_G4        : 1;  /* [    4],       None,        0x0 */
            uint32_t reserved_5_31 : 27; /* [31: 5],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_IGR;

    /* 0x144 : DEV_ISG0 */
    union {
        struct
        {
            uint32_t CX_SETUP_INT   : 1;  /* [    0],       None,        0x0 */
            uint32_t CX_IN_INT      : 1;  /* [    1],       None,        0x0 */
            uint32_t CX_OUT_INT     : 1;  /* [    2],       None,        0x0 */
            uint32_t reserved_3     : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t CX_COMFAIL_INT : 1;  /* [    4],       None,        0x0 */
            uint32_t CX_COMABT_INT  : 1;  /* [    5],       None,        0x0 */
            uint32_t reserved_6_31  : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_ISG0;

    /* 0x148 : DEV_ISG1 */
    union {
        struct
        {
            uint32_t F0_OUT_INT : 1; /* [    0],       None,        0x0 */
            uint32_t F0_SPK_INT : 1; /* [    1],       None,        0x0 */
            uint32_t F1_OUT_INT : 1; /* [    2],       None,        0x0 */
            uint32_t F1_SPK_INT : 1; /* [    3],       None,        0x0 */
            uint32_t F2_OUT_INT : 1; /* [    4],       None,        0x0 */
            uint32_t F2_SPK_INT : 1; /* [    5],       None,        0x0 */
            uint32_t F3_OUT_INT : 1; /* [    6],       None,        0x0 */
            uint32_t F3_SPK_INT : 1; /* [    7],       None,        0x0 */
            uint32_t F4_OUT_INT : 1; /* [    8],       None,        0x0 */
            uint32_t F4_SPK_INT : 1; /* [    9],       None,        0x0 */
            uint32_t F5_OUT_INT : 1; /* [   10],       None,        0x0 */
            uint32_t F5_SPK_INT : 1; /* [   11],       None,        0x0 */
            uint32_t F6_OUT_INT : 1; /* [   12],       None,        0x0 */
            uint32_t F6_SPK_INT : 1; /* [   13],       None,        0x0 */
            uint32_t F7_OUT_INT : 1; /* [   14],       None,        0x0 */
            uint32_t F7_SPK_INT : 1; /* [   15],       None,        0x0 */
            uint32_t F0_IN_INT  : 1; /* [   16],       None,        0x0 */
            uint32_t F1_IN_INT  : 1; /* [   17],       None,        0x0 */
            uint32_t F2_IN_INT  : 1; /* [   18],       None,        0x0 */
            uint32_t F3_IN_INT  : 1; /* [   19],       None,        0x0 */
            uint32_t F4_IN_INT  : 1; /* [   20],       None,        0x0 */
            uint32_t F5_IN_INT  : 1; /* [   21],       None,        0x0 */
            uint32_t F6_IN_INT  : 1; /* [   22],       None,        0x0 */
            uint32_t F7_IN_INT  : 1; /* [   23],       None,        0x0 */
            uint32_t F8_IN_INT  : 1; /* [   24],       None,        0x0 */
            uint32_t F9_IN_INT  : 1; /* [   25],       None,        0x0 */
            uint32_t F10_IN_INT : 1; /* [   26],       None,        0x0 */
            uint32_t F11_IN_INT : 1; /* [   27],       None,        0x0 */
            uint32_t F12_IN_INT : 1; /* [   28],       None,        0x0 */
            uint32_t F13_IN_INT : 1; /* [   29],       None,        0x0 */
            uint32_t F14_IN_INT : 1; /* [   30],       None,        0x0 */
            uint32_t F15_IN_INT : 1; /* [   31],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_ISG1;

    /* 0x14C : DEV_ISG2 */
    union {
        struct
        {
            uint32_t USBRST_INT        : 1; /* [    0],       None,        0x0 */
            uint32_t SUSP_INT          : 1; /* [    1],       None,        0x0 */
            uint32_t RESM_INT          : 1; /* [    2],       None,        0x0 */
            uint32_t ISO_SEQ_ERR_INT   : 1; /* [    3],       None,        0x0 */
            uint32_t ISO_SEQ_ABORT_INT : 1; /* [    4],       None,        0x0 */
            uint32_t TX0BYTE_INT       : 1; /* [    5],       None,        0x0 */
            uint32_t RX0BYTE_INT       : 1; /* [    6],       None,        0x0 */
            uint32_t DMA_CMPLT_HOV     : 1; /* [    7],       None,        0x0 */
            uint32_t DMA_ERROR_HOV     : 1; /* [    8],       None,        0x0 */
            uint32_t Dev_Idle_HOV      : 1; /* [    9],       None,        0x0 */
            uint32_t Dev_Wakeup_byVBUS : 1; /* [   10],       None,        0x0 */
            uint32_t reserved_11_15    : 5; /* [15:11],       rsvd,        0x0 */
            uint32_t F8_OUT_INT        : 1; /* [   16],       None,        0x0 */
            uint32_t F8_SPK_INT        : 1; /* [   17],       None,        0x0 */
            uint32_t F9_OUT_INT        : 1; /* [   18],       None,        0x0 */
            uint32_t F9_SPK_INT        : 1; /* [   19],       None,        0x0 */
            uint32_t F10_OUT_INT       : 1; /* [   20],       None,        0x0 */
            uint32_t F10_SPK_INT       : 1; /* [   21],       None,        0x0 */
            uint32_t F11_OUT_INT       : 1; /* [   22],       None,        0x0 */
            uint32_t F11_SPK_INT       : 1; /* [   23],       None,        0x0 */
            uint32_t F12_OUT_INT       : 1; /* [   24],       None,        0x0 */
            uint32_t F12_SPK_INT       : 1; /* [   25],       None,        0x0 */
            uint32_t F13_OUT_INT       : 1; /* [   26],       None,        0x0 */
            uint32_t F13_SPK_INT       : 1; /* [   27],       None,        0x0 */
            uint32_t F14_OUT_INT       : 1; /* [   28],       None,        0x0 */
            uint32_t F14_SPK_INT       : 1; /* [   29],       None,        0x0 */
            uint32_t F15_OUT_INT       : 1; /* [   30],       None,        0x0 */
            uint32_t F15_SPK_INT       : 1; /* [   31],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_ISG2;

    /* 0x150 : DEV_RXZ */
    union {
        struct
        {
            uint32_t RX0BYTE_EP1   : 1;  /* [    0],       None,        0x0 */
            uint32_t RX0BYTE_EP2   : 1;  /* [    1],       None,        0x0 */
            uint32_t RX0BYTE_EP3   : 1;  /* [    2],       None,        0x0 */
            uint32_t RX0BYTE_EP4   : 1;  /* [    3],       None,        0x0 */
            uint32_t RX0BYTE_EP5   : 1;  /* [    4],       None,        0x0 */
            uint32_t RX0BYTE_EP6   : 1;  /* [    5],       None,        0x0 */
            uint32_t RX0BYTE_EP7   : 1;  /* [    6],       None,        0x0 */
            uint32_t RX0BYTE_EP8   : 1;  /* [    7],       None,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_RXZ;

