RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/usb_reg.h
    /* 0x178 : DEV_INMPS7 */
    union {
        struct
        {
            uint32_t MAXPS_IEP7      : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_IEP7        : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_IEP7       : 1;  /* [   12],       None,        0x0 */
            uint32_t TX_NUM_HBW_IEP7 : 2;  /* [14:13],       None,        0x0 */
            uint32_t TX0BYTE_IEP7    : 1;  /* [   15],       None,        0x0 */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_INMPS7;

    /* 0x17C : DEV_INMPS8 */
    union {
        struct
        {
            uint32_t MAXPS_IEP8      : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_IEP8        : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_IEP8       : 1;  /* [   12],       None,        0x0 */
            uint32_t TX_NUM_HBW_IEP8 : 2;  /* [14:13],       None,        0x0 */
            uint32_t TX0BYTE_IEP8    : 1;  /* [   15],       None,        0x0 */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_INMPS8;

    /* 0x180 : DEV_OUTMPS1 */
    union {
        struct
        {
            uint32_t MAXPS_OEP1     : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_OEP1       : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_OEP1      : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_OUTMPS1;

    /* 0x184 : DEV_OUTMPS2 */
    union {
        struct
        {
            uint32_t MAXPS_OEP2     : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_OEP2       : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_OEP2      : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_OUTMPS2;

    /* 0x188 : DEV_OUTMPS3 */
    union {
        struct
        {
            uint32_t MAXPS_OEP3     : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_OEP3       : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_OEP3      : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_OUTMPS3;

    /* 0x18C : DEV_OUTMPS4 */
    union {
        struct
        {
            uint32_t MAXPS_OEP4     : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_OEP4       : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_OEP4      : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_OUTMPS4;

    /* 0x190 : DEV_OUTMPS5 */
    union {
        struct
        {
            uint32_t MAXPS_OEP5     : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_OEP5       : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_OEP5      : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_OUTMPS5;

    /* 0x194 : DEV_OUTMPS6 */
    union {
        struct
        {
            uint32_t MAXPS_OEP6     : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_OEP6       : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_OEP6      : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_OUTMPS6;

    /* 0x198 : DEV_OUTMPS7 */
    union {
        struct
        {
            uint32_t MAXPS_OEP7     : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_OEP7       : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_OEP7      : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_OUTMPS7;

    /* 0x19C : DEV_OUTMPS8 */
    union {
        struct
        {
            uint32_t MAXPS_OEP8     : 11; /* [10: 0],       None,        0x0 */
            uint32_t STL_OEP8       : 1;  /* [   11],       None,        0x0 */
            uint32_t RSTG_OEP8      : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_OUTMPS8;

    /* 0x1A0 : DEV_EPMAP08 */
    union {
        struct
        {
            uint32_t FNO_IEP1 : 4; /* [ 3: 0],       None,        0x0 */
            uint32_t FNO_OEP1 : 4; /* [ 7: 4],       None,        0x0 */
            uint32_t FNO_IEP2 : 4; /* [11: 8],       None,        0x0 */
            uint32_t FNO_OEP2 : 4; /* [15:12],       None,        0x0 */
            uint32_t FNO_IEP3 : 4; /* [19:16],       None,        0x0 */
            uint32_t FNO_OEP3 : 4; /* [23:20],       None,        0x0 */
            uint32_t FNO_IEP4 : 4; /* [27:24],       None,        0x0 */
            uint32_t FNO_OEP4 : 4; /* [31:28],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_EPMAP08;

    /* 0x1A4 : DEV_EPMAP1 */
    union {
        struct
        {
            uint32_t FNO_IEP5 : 4; /* [ 3: 0],       None,        0x0 */
            uint32_t FNO_OEP5 : 4; /* [ 7: 4],       None,        0x0 */
            uint32_t FNO_IEP6 : 4; /* [11: 8],       None,        0x0 */
            uint32_t FNO_OEP6 : 4; /* [15:12],       None,        0x0 */
            uint32_t FNO_IEP7 : 4; /* [19:16],       None,        0x0 */
            uint32_t FNO_OEP7 : 4; /* [23:20],       None,        0x0 */
            uint32_t FNO_IEP8 : 4; /* [27:24],       None,        0x0 */
            uint32_t FNO_OEP8 : 4; /* [31:28],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_EPMAP1;

    /* 0x1A8 : DEV_FMAP */
    union {
        struct
        {
            uint32_t EPNO_FIFO0     : 4; /* [ 3: 0],       None,        0x0 */
            uint32_t Dir_FIFO0      : 2; /* [ 5: 4],       None,        0x0 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t EPNO_FIFO1     : 4; /* [11: 8],       None,        0x0 */
            uint32_t Dir_FIFO1      : 2; /* [13:12],       None,        0x0 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t EPNO_FIFO2     : 4; /* [19:16],       None,        0x0 */
            uint32_t Dir_FIFO2      : 2; /* [21:20],       None,        0x0 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t EPNO_FIFO3     : 4; /* [27:24],       None,        0x0 */
            uint32_t Dir_FIFO3      : 2; /* [29:28],       None,        0x0 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FMAP;

    /* 0x1AC : DEV_FCFG */
    union {
        struct
        {
            uint32_t BLK_TYP_F0     : 2; /* [ 1: 0],       None,        0x0 */
            uint32_t BLKNO_F0       : 2; /* [ 3: 2],       None,        0x0 */
            uint32_t BLKSZ_F0       : 1; /* [    4],       None,        0x0 */
            uint32_t EN_F0          : 1; /* [    5],       None,        0x0 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t BLK_TYP_F1     : 2; /* [ 9: 8],       None,        0x0 */
            uint32_t BLKNO_F1       : 2; /* [11:10],       None,        0x0 */
            uint32_t BLKSZ_F1       : 1; /* [   12],       None,        0x0 */
            uint32_t EN_F1          : 1; /* [   13],       None,        0x0 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t BLK_TYP_F2     : 2; /* [17:16],       None,        0x0 */
            uint32_t BLKNO_F2       : 2; /* [19:18],       None,        0x0 */
            uint32_t BLKSZ_F2       : 1; /* [   20],       None,        0x0 */
            uint32_t EN_F2          : 1; /* [   21],       None,        0x0 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t BLK_TYP_F3     : 2; /* [25:24],       None,        0x0 */
            uint32_t BLKNO_F3       : 2; /* [27:26],       None,        0x0 */
            uint32_t BLKSZ_F3       : 1; /* [   28],       None,        0x0 */
            uint32_t EN_F3          : 1; /* [   29],       None,        0x0 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FCFG;

    /* 0x1B0 : DEV_FIBC0 */
    union {
        struct
        {
            uint32_t BC_F0          : 11; /* [10: 0],       None,        0x0 */
            uint32_t rsvdp          : 1;  /* [   11],       None,        0x0 */
            uint32_t FFRST0_HOV     : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FIBC0;

    /* 0x1B4 : DEV_FIBC1 */
    union {
        struct
        {
            uint32_t BC_F1          : 11; /* [10: 0],       None,        0x0 */
            uint32_t reserved_11    : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t FFRST1_HOV     : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FIBC1;

    /* 0x1B8 : DEV_FIBC2 */
    union {
        struct
        {
            uint32_t BC_F2          : 11; /* [10: 0],       None,        0x0 */
            uint32_t reserved_11    : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t FFRST2_HOV     : 1;  /* [   12],       None,        0x0 */
            uint32_t reserved_13_31 : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FIBC2;

    /* 0x1BC : DEV_FIBC3 */
    union {
        struct
        {
            uint32_t BC_F3      : 11; /* [10: 0],       None,        0x0 */
            uint32_t rsvdp      : 1;  /* [   11],       None,        0x0 */
            uint32_t FFRST3_HOV : 1;  /* [   12],       None,        0x0 */
            uint32_t rsvd_31_13 : 19; /* [31:13],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_FIBC3;

