RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/usb_reg.h
    /* 0x33C : DEV_MISG4 */
    union {
        struct
        {
            uint32_t ML1_INT         : 1;  /* [    0],       None,        0x0 */
            uint32_t reserved_1_15   : 15; /* [15: 1],       rsvd,        0x0 */
            uint32_t MVDMA_CMPLT_F15 : 1;  /* [   16],       None,        0x0 */
            uint32_t reserved_17_23  : 7;  /* [23:17],       rsvd,        0x0 */
            uint32_t MVDMA_ERROR_F15 : 1;  /* [   24],       None,        0x0 */
            uint32_t reserved_25_31  : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DEV_MISG4;

    /* 0x340  reserved */
    uint8_t RESERVED0x340[16];

    /* 0x350 : VDMA_FnPS1 */
    union {
        struct
        {
            uint32_t VDMA_START_Fn  : 1;  /* [    0],       None,        0x0 */
            uint32_t VDMA_TYPE_Fn   : 1;  /* [    1],       None,        0x0 */
            uint32_t VDMA_IO_Fn     : 1;  /* [    2],       None,        0x0 */
            uint32_t reserved_3_7   : 5;  /* [ 7: 3],       rsvd,        0x0 */
            uint32_t VDMA_LEN_Fn    : 17; /* [24: 8],       None,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } VDMA_FnPS1;

    /* 0x354 : VDMA_FnPS2 */
    union {
        struct
        {
            uint32_t VDMA_MADDR_Fn : 32; /* [31: 0],       None,        0x0 */
        } BF;
        uint32_t WORD;
    } VDMA_FnPS2;
};

typedef volatile struct usb_reg usb_reg_t;

#endif /* __USB_REG_H__ */
